[Timeout] EqualityOperator
src/common/Tools.ts:12:21
 
 export const generateFieldData = (width: number, height: number, randomPercent = 0): number[][] => {
     const result = [];
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i <= height; i++) {
         const row = [];
         for (let j = 0; j < width; j++) {

[Timeout] UpdateOperator
src/common/Tools.ts:12:33
 
 export const generateFieldData = (width: number, height: number, randomPercent = 0): number[][] => {
     const result = [];
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i < height; i--) {
         const row = [];
         for (let j = 0; j < width; j++) {

[Timeout] EqualityOperator
src/common/Tools.ts:14:25
     const result = [];
     for (let i = 0; i < height; i++) {
         const row = [];
-        for (let j = 0; j < width; j++) {
+        for (let j = 0; j <= width; j++) {
             row.push(0);
         }

[Timeout] UpdateOperator
src/common/Tools.ts:14:36
     const result = [];
     for (let i = 0; i < height; i++) {
         const row = [];
-        for (let j = 0; j < width; j++) {
+        for (let j = 0; j < width; j--) {
             row.push(0);
         }

[Timeout] BlockStatement
src/common/Tools.ts:23:100
     return result;
 };
 
-const fillFieldRandom = (fieldData: number[][], width: number, height: number, percent: number) => {
-    const count = Math.floor((width * height * percent) / 100);
-    for (let r = 0; r < count; r++) {
-        let deadOffset = 0;
-        const rand = Math.floor(Math.random() * (width * height - r)) + 1;
-        for (let i = 0; i < height; i++) {
-            for (let j = 0; j < width; j++) {
-                if (fieldData[i][j] === 0) {
-                    deadOffset++;
-                }
-                if (rand === deadOffset) {
-                    fieldData[i][j] = 1;
-                    break;
-                }
-            }
-            if (rand === deadOffset) {
-                break;
-            }
-        }
-    }
-};
+const fillFieldRandom = (fieldData: number[][], width: number, height: number, percent: number) => {};
 
 export const generateFieldByField = (width: number, height: number, sourceField: Field): Field => {

[Timeout] ArithmeticOperator
src/common/Tools.ts:24:30
 };
 
 const fillFieldRandom = (fieldData: number[][], width: number, height: number, percent: number) => {
-    const count = Math.floor((width * height * percent) / 100);
+    const count = Math.floor(width * height * percent * 100);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;

[Timeout] ArithmeticOperator
src/common/Tools.ts:24:31
 };
 
 const fillFieldRandom = (fieldData: number[][], width: number, height: number, percent: number) => {
-    const count = Math.floor((width * height * percent) / 100);
+    const count = Math.floor((width / height * percent) / 100);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;

[Timeout] BlockStatement
src/common/Tools.ts:25:37
 
 const fillFieldRandom = (fieldData: number[][], width: number, height: number, percent: number) => {
     const count = Math.floor((width * height * percent) / 100);
-    for (let r = 0; r < count; r++) {
-        let deadOffset = 0;
-        const rand = Math.floor(Math.random() * (width * height - r)) + 1;
-        for (let i = 0; i < height; i++) {
-            for (let j = 0; j < width; j++) {
-                if (fieldData[i][j] === 0) {
-                    deadOffset++;
-                }
-                if (rand === deadOffset) {
-                    fieldData[i][j] = 1;
-                    break;
-                }
-            }
-            if (rand === deadOffset) {
-                break;
-            }
-        }
-    }
+    for (let r = 0; r < count; r++) {}
 };
 

[Timeout] EqualityOperator
src/common/Tools.ts:25:21
 
 const fillFieldRandom = (fieldData: number[][], width: number, height: number, percent: number) => {
     const count = Math.floor((width * height * percent) / 100);
-    for (let r = 0; r < count; r++) {
+    for (let r = 0; r >= count; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;

[Timeout] ArithmeticOperator
src/common/Tools.ts:27:50
     const count = Math.floor((width * height * percent) / 100);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
-        const rand = Math.floor(Math.random() * (width * height - r)) + 1;
+        const rand = Math.floor(Math.random() * (width / height - r)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {

[Timeout] ArithmeticOperator
src/common/Tools.ts:27:33
     const count = Math.floor((width * height * percent) / 100);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
-        const rand = Math.floor(Math.random() * (width * height - r)) + 1;
+        const rand = Math.floor(Math.random() / (width * height - r)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {

[Timeout] ConditionalExpression
src/common/Tools.ts:28:25
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;
-        for (let i = 0; i < height; i++) {
+        for (let i = 0; false; i++) {
             for (let j = 0; j < width; j++) {
                 if (fieldData[i][j] === 0) {

[Timeout] UpdateOperator
src/common/Tools.ts:28:37
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;
-        for (let i = 0; i < height; i++) {
+        for (let i = 0; i < height; i--) {
             for (let j = 0; j < width; j++) {
                 if (fieldData[i][j] === 0) {

[Timeout] UpdateOperator
src/common/Tools.ts:29:40
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;
         for (let i = 0; i < height; i++) {
-            for (let j = 0; j < width; j++) {
+            for (let j = 0; j < width; j--) {
                 if (fieldData[i][j] === 0) {
                     deadOffset++;

[Timeout] ConditionalExpression
src/common/Tools.ts:29:29
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;
         for (let i = 0; i < height; i++) {
-            for (let j = 0; j < width; j++) {
+            for (let j = 0; false; j++) {
                 if (fieldData[i][j] === 0) {
                     deadOffset++;

[Timeout] ConditionalExpression
src/common/Tools.ts:30:21
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {
-                if (fieldData[i][j] === 0) {
+                if (false) {
                     deadOffset++;
                 }

[Timeout] ConditionalExpression
src/common/Tools.ts:30:21
         const rand = Math.floor(Math.random() * (width * height - r)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {
-                if (fieldData[i][j] === 0) {
+                if (true) {
                     deadOffset++;
                 }

[Timeout] UpdateOperator
src/common/Tools.ts:31:21
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {
                 if (fieldData[i][j] === 0) {
-                    deadOffset++;
+                    deadOffset--;
                 }
                 if (rand === deadOffset) {

[Timeout] EqualityOperator
src/common/Tools.ts:33:21
                 if (fieldData[i][j] === 0) {
                     deadOffset++;
                 }
-                if (rand === deadOffset) {
+                if (rand !== deadOffset) {
                     fieldData[i][j] = 1;
                     break;

[Timeout] BlockStatement
src/common/Tools.ts:33:42
                 if (fieldData[i][j] === 0) {
                     deadOffset++;
                 }
-                if (rand === deadOffset) {
-                    fieldData[i][j] = 1;
-                    break;
-                }
+                if (rand === deadOffset) {}
             }
             if (rand === deadOffset) {

[Timeout] ConditionalExpression
src/common/Tools.ts:38:17
                     break;
                 }
             }
-            if (rand === deadOffset) {
+            if (true) {
                 break;
             }

[Timeout] BlockStatement
src/common/Tools.ts:38:38
                     break;
                 }
             }
-            if (rand === deadOffset) {
-                break;
-            }
+            if (rand === deadOffset) {}
         }
     }

[Timeout] UpdateOperator
src/common/Tools.ts:49:36
     const targetField = generateField(width, height);
     const minWidth = Math.min(targetField.width, sourceField.width);
     const minHeight = Math.min(targetField.height, sourceField.height);
-    for (let i = 0; i < minHeight; i++) {
+    for (let i = 0; i < minHeight; i--) {
         for (let j = 0; j < minWidth; j++) {
             targetField.data[i][j] = sourceField.data[i][j];

[Timeout] ConditionalExpression
src/common/Tools.ts:49:21
     const targetField = generateField(width, height);
     const minWidth = Math.min(targetField.width, sourceField.width);
     const minHeight = Math.min(targetField.height, sourceField.height);
-    for (let i = 0; i < minHeight; i++) {
+    for (let i = 0; false; i++) {
         for (let j = 0; j < minWidth; j++) {
             targetField.data[i][j] = sourceField.data[i][j];

[Timeout] BlockStatement
src/common/Tools.ts:50:44
     const minWidth = Math.min(targetField.width, sourceField.width);
     const minHeight = Math.min(targetField.height, sourceField.height);
     for (let i = 0; i < minHeight; i++) {
-        for (let j = 0; j < minWidth; j++) {
-            targetField.data[i][j] = sourceField.data[i][j];
-        }
+        for (let j = 0; j < minWidth; j++) {}
     }
     targetField.generation = sourceField.generation;

[Timeout] EqualityOperator
src/common/Tools.ts:50:25
     const minWidth = Math.min(targetField.width, sourceField.width);
     const minHeight = Math.min(targetField.height, sourceField.height);
     for (let i = 0; i < minHeight; i++) {
-        for (let j = 0; j < minWidth; j++) {
+        for (let j = 0; j <= minWidth; j++) {
             targetField.data[i][j] = sourceField.data[i][j];
         }

[Timeout] BlockStatement
src/common/Tools.ts:61:38
 export const getEnvironment = (field: Field): number[][] => {
     const { width, height, data } = field;
     const result = generateFieldData(width, height);
-    for (let i = 0; i < height; i++) {
-        for (let j = 0; j < width; j++) {
-            if (data[i][j] > 0) {
-                for (let si = -1; si <= 1; si++) {
-                    for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
-                            const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
-                            result[row][cell]++;
-                        }
-                    }
-                }
-            }
-        }
-    }
+    for (let i = 0; i < height; i++) {}
     return result;
 };

[Timeout] UpdateOperator
src/common/Tools.ts:61:33
 export const getEnvironment = (field: Field): number[][] => {
     const { width, height, data } = field;
     const result = generateFieldData(width, height);
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i < height; i--) {
         for (let j = 0; j < width; j++) {
             if (data[i][j] > 0) {

[Timeout] EqualityOperator
src/common/Tools.ts:62:25
     const { width, height, data } = field;
     const result = generateFieldData(width, height);
     for (let i = 0; i < height; i++) {
-        for (let j = 0; j < width; j++) {
+        for (let j = 0; j >= width; j++) {
             if (data[i][j] > 0) {
                 for (let si = -1; si <= 1; si++) {

[Timeout] EqualityOperator
src/common/Tools.ts:63:17
     const result = generateFieldData(width, height);
     for (let i = 0; i < height; i++) {
         for (let j = 0; j < width; j++) {
-            if (data[i][j] > 0) {
+            if (data[i][j] <= 0) {
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {

[Timeout] ConditionalExpression
src/common/Tools.ts:63:17
     const result = generateFieldData(width, height);
     for (let i = 0; i < height; i++) {
         for (let j = 0; j < width; j++) {
-            if (data[i][j] > 0) {
+            if (true) {
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {

[Timeout] EqualityOperator
src/common/Tools.ts:64:35
     for (let i = 0; i < height; i++) {
         for (let j = 0; j < width; j++) {
             if (data[i][j] > 0) {
-                for (let si = -1; si <= 1; si++) {
+                for (let si = -1; si < 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {

[Timeout] UpdateOperator
src/common/Tools.ts:64:44
     for (let i = 0; i < height; i++) {
         for (let j = 0; j < width; j++) {
             if (data[i][j] > 0) {
-                for (let si = -1; si <= 1; si++) {
+                for (let si = -1; si <= 1; si--) {
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {

[Timeout] EqualityOperator
src/common/Tools.ts:65:39
         for (let j = 0; j < width; j++) {
             if (data[i][j] > 0) {
                 for (let si = -1; si <= 1; si++) {
-                    for (let sj = -1; sj <= 1; sj++) {
+                    for (let sj = -1; sj > 1; sj++) {
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;

[Timeout] EqualityOperator
src/common/Tools.ts:65:39
         for (let j = 0; j < width; j++) {
             if (data[i][j] > 0) {
                 for (let si = -1; si <= 1; si++) {
-                    for (let sj = -1; sj <= 1; sj++) {
+                    for (let sj = -1; sj < 1; sj++) {
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;

[Timeout] LogicalOperator
src/common/Tools.ts:66:29
             if (data[i][j] > 0) {
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
+                        if (si !== 0 && sj !== 0) {
                             const row = (i + si + height) % height;
                             const cell = (j + sj + width) % width;

[Timeout] EqualityOperator
src/common/Tools.ts:66:29
             if (data[i][j] > 0) {
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
+                        if (si === 0 || sj !== 0) {
                             const row = (i + si + height) % height;
                             const cell = (j + sj + width) % width;

[Timeout] ArithmeticOperator
src/common/Tools.ts:67:41
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {
-                            const row = (i + si + height) % height;
+                            const row = (i + si + height) * height;
                             const cell = (j + sj + width) % width;
                             result[row][cell]++;

[Timeout] ArithmeticOperator
src/common/Tools.ts:67:42
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {
-                            const row = (i + si + height) % height;
+                            const row = (i + si - height) % height;
                             const cell = (j + sj + width) % width;
                             result[row][cell]++;

[Timeout] ArithmeticOperator
src/common/Tools.ts:68:43
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
+                            const cell = (j - sj + width) % width;
                             result[row][cell]++;
                         }

[Timeout] ArithmeticOperator
src/common/Tools.ts:68:43
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
+                            const cell = (j + sj - width) % width;
                             result[row][cell]++;
                         }

[Timeout] UpdateOperator
src/common/Tools.ts:69:29
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;
                             const cell = (j + sj + width) % width;
-                            result[row][cell]++;
+                            result[row][cell]--;
                         }
                     }

[Timeout] EqualityOperator
src/common/Tools.ts:83:21
     const { width, height, data, generation } = field;
     const environment = getEnvironment(field);
     const result = generateFieldData(width, height);
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i >= height; i++) {
         for (let j = 0; j < width; j++) {
             const cellState = data[i][j];

[Timeout] EqualityOperator
src/common/Tools.ts:83:21
     const { width, height, data, generation } = field;
     const environment = getEnvironment(field);
     const result = generateFieldData(width, height);
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i <= height; i++) {
         for (let j = 0; j < width; j++) {
             const cellState = data[i][j];

[Timeout] EqualityOperator
src/common/Tools.ts:84:25
     const environment = getEnvironment(field);
     const result = generateFieldData(width, height);
     for (let i = 0; i < height; i++) {
-        for (let j = 0; j < width; j++) {
+        for (let j = 0; j <= width; j++) {
             const cellState = data[i][j];
             const cellEnv = environment[i][j];

[Timeout] ConditionalExpression
src/common/Tools.ts:87:17
         for (let j = 0; j < width; j++) {
             const cellState = data[i][j];
             const cellEnv = environment[i][j];
-            if (cellState === 0 && cellEnv === 3) {
+            if (true) {
                 result[i][j] = 1;
             }

[Timeout] ConditionalExpression
src/common/Tools.ts:87:17
         for (let j = 0; j < width; j++) {
             const cellState = data[i][j];
             const cellEnv = environment[i][j];
-            if (cellState === 0 && cellEnv === 3) {
+            if (true && cellEnv === 3) {
                 result[i][j] = 1;
             }

[Timeout] EqualityOperator
src/common/Tools.ts:90:17
             if (cellState === 0 && cellEnv === 3) {
                 result[i][j] = 1;
             }
-            if (cellState > 0 && cellEnv >= 2 && cellEnv <= 3) {
+            if (cellState >= 0 && cellEnv >= 2 && cellEnv <= 3) {
                 result[i][j] = 2;
             }

[Timeout] EqualityOperator
src/common/Tools.ts:90:50
             if (cellState === 0 && cellEnv === 3) {
                 result[i][j] = 1;
             }
-            if (cellState > 0 && cellEnv >= 2 && cellEnv <= 3) {
+            if (cellState > 0 && cellEnv >= 2 && cellEnv > 3) {
                 result[i][j] = 2;
             }

[Timeout] ArithmeticOperator
src/common/Tools.ts:95:50
             }
         }
     }
-    return { ...field, data: result, generation: generation + 1 };
+    return { ...field, data: result, generation: generation - 1 };
 };
 

[Timeout] ConditionalExpression
src/common/Tools.ts:108:9
 };
 
 export const equalMatrix = (m1: number[][], m2: number[][]): boolean => {
-    if (m1.length !== m2.length) return false;
+    if (false) return false;
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];

[Timeout] ConditionalExpression
src/common/Tools.ts:108:9
 };
 
 export const equalMatrix = (m1: number[][], m2: number[][]): boolean => {
-    if (m1.length !== m2.length) return false;
+    if (true) return false;
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];

[Timeout] ConditionalExpression
src/common/Tools.ts:109:21
 
 export const equalMatrix = (m1: number[][], m2: number[][]): boolean => {
     if (m1.length !== m2.length) return false;
-    for (let i = 0; i < m1.length; i++) {
+    for (let i = 0; false; i++) {
         const row1 = m1[i];
         const row2 = m2[i];

[Timeout] EqualityOperator
src/common/Tools.ts:109:21
 
 export const equalMatrix = (m1: number[][], m2: number[][]): boolean => {
     if (m1.length !== m2.length) return false;
-    for (let i = 0; i < m1.length; i++) {
+    for (let i = 0; i <= m1.length; i++) {
         const row1 = m1[i];
         const row2 = m2[i];

[Timeout] BooleanLiteral
src/common/Tools.ts:112:49
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];
         const row2 = m2[i];
-        if (row1.length !== row2.length) return false;
+        if (row1.length !== row2.length) return true;
         for (let j = 0; j < row1.length; j++) {
             if (row1[j] !== row2[j]) return false;

[Timeout] EqualityOperator
src/common/Tools.ts:112:13
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];
         const row2 = m2[i];
-        if (row1.length !== row2.length) return false;
+        if (row1.length === row2.length) return false;
         for (let j = 0; j < row1.length; j++) {
             if (row1[j] !== row2[j]) return false;

[Timeout] EqualityOperator
src/common/Tools.ts:113:25
         const row1 = m1[i];
         const row2 = m2[i];
         if (row1.length !== row2.length) return false;
-        for (let j = 0; j < row1.length; j++) {
+        for (let j = 0; j >= row1.length; j++) {
             if (row1[j] !== row2[j]) return false;
         }

[Timeout] EqualityOperator
src/common/Tools.ts:113:25
         const row1 = m1[i];
         const row2 = m2[i];
         if (row1.length !== row2.length) return false;
-        for (let j = 0; j < row1.length; j++) {
+        for (let j = 0; j <= row1.length; j++) {
             if (row1[j] !== row2[j]) return false;
         }

[Timeout] BooleanLiteral
src/common/Tools.ts:114:45
         const row2 = m2[i];
         if (row1.length !== row2.length) return false;
         for (let j = 0; j < row1.length; j++) {
-            if (row1[j] !== row2[j]) return false;
+            if (row1[j] !== row2[j]) return true;
         }
     }

[Timeout] ConditionalExpression
src/common/Tools.ts:114:17
         const row2 = m2[i];
         if (row1.length !== row2.length) return false;
         for (let j = 0; j < row1.length; j++) {
-            if (row1[j] !== row2[j]) return false;
+            if (false) return false;
         }
     }

[Killed] ConditionalExpression
src/common/Tools.ts:122:9
 
 export const getCellStateByFieldCell = (cell: number): CellProps["state"] => {
     switch (cell) {
-        case 0:
-            return "dead";
+        case 0:
         case 1:
             return "young";
killedBy: All tests
statusReason: > stat-game-of-life@0.1.0 test
> jest


FAIL src/common/Tools.test.ts

  ● Test suite failed to run

[Timeout] ConditionalExpression
src/common/Tools.ts:124:9
     switch (cell) {
         case 0:
             return "dead";
-        case 1:
-            return "young";
+        case 1:
         case 2:
             return "old";

[Timeout] ConditionalExpression
src/common/Tools.ts:126:9
             return "dead";
         case 1:
             return "young";
-        case 2:
-            return "old";
+        case 2:
         default:
             throw new Error(`Нет состояния ячейки с кодом ${cell}`);

[Timeout] StringLiteral
src/common/Tools.ts:129:29
         case 2:
             return "old";
         default:
-            throw new Error(`Нет состояния ячейки с кодом ${cell}`);
+            throw new Error(``);
     }
 };
