[Timeout] StringLiteral
src/components/styled/MainContainer.tsx:3:36
 import styled from "styled-components";
 
-const MainContainer = styled("div")`
-    background: #333;
-    box-shadow: 0px 16px 30px 0px #200;
-    width: fit-content;
-    z-index: 0;
-`;
+const MainContainer = styled("div")``;
 
 export default MainContainer;
