[Timeout] ConditionalExpression
src/components/statistic/MinMaxAvr.tsx:18:17
 const MinMaxAvr = (props: MinMaxAvrProps) => {
     const { data } = props;
     const count = data.length;
-    const max = count > 0 ? Math.max(...data).toFixed(2) : "-";
+    const max = true ? Math.max(...data).toFixed(2) : "-";
     const min = count > 0 ? Math.min(...data).toFixed(2) : "-";
     const avr = count > 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";

[Timeout] EqualityOperator
src/components/statistic/MinMaxAvr.tsx:18:17
 const MinMaxAvr = (props: MinMaxAvrProps) => {
     const { data } = props;
     const count = data.length;
-    const max = count > 0 ? Math.max(...data).toFixed(2) : "-";
+    const max = count <= 0 ? Math.max(...data).toFixed(2) : "-";
     const min = count > 0 ? Math.min(...data).toFixed(2) : "-";
     const avr = count > 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";

[Timeout] ConditionalExpression
src/components/statistic/MinMaxAvr.tsx:19:17
     const { data } = props;
     const count = data.length;
     const max = count > 0 ? Math.max(...data).toFixed(2) : "-";
-    const min = count > 0 ? Math.min(...data).toFixed(2) : "-";
+    const min = true ? Math.min(...data).toFixed(2) : "-";
     const avr = count > 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";
     return (

[Timeout] EqualityOperator
src/components/statistic/MinMaxAvr.tsx:19:17
     const { data } = props;
     const count = data.length;
     const max = count > 0 ? Math.max(...data).toFixed(2) : "-";
-    const min = count > 0 ? Math.min(...data).toFixed(2) : "-";
+    const min = count >= 0 ? Math.min(...data).toFixed(2) : "-";
     const avr = count > 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";
     return (

[Timeout] ConditionalExpression
src/components/statistic/MinMaxAvr.tsx:20:17
     const count = data.length;
     const max = count > 0 ? Math.max(...data).toFixed(2) : "-";
     const min = count > 0 ? Math.min(...data).toFixed(2) : "-";
-    const avr = count > 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";
+    const avr = true ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";
     return (
         <MinMaxAvrContainer>

[Timeout] EqualityOperator
src/components/statistic/MinMaxAvr.tsx:20:17
     const count = data.length;
     const max = count > 0 ? Math.max(...data).toFixed(2) : "-";
     const min = count > 0 ? Math.min(...data).toFixed(2) : "-";
-    const avr = count > 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";
+    const avr = count >= 0 ? (data.reduce((a, b) => a + b, 0) / data.length).toFixed(2) : "-";
     return (
         <MinMaxAvrContainer>
