[Timeout] StringLiteral
src/components/statistic/SimpleChart.tsx:10:37
     height: number;
 }
 
-const ChartContainer = styled("div")`
-    background: #aaa;
-    border-radius: 10px;
-    box-shadow: 0px 16px 30px 0px #200;
-    border: solid 1px #fff;
-    width: fit-content;
-    margin: 10px auto;
-`;
+const ChartContainer = styled("div")``;
 
 const SimpleChart = (props: SimpleChartProps) => {

[Timeout] ArithmeticOperator
src/components/statistic/SimpleChart.tsx:23:20
     const { data, maxValue, width, height, ...other } = props;
 
     const max: number = maxValue ? maxValue : Math.max(...data);
-    const hScale = height / max;
+    const hScale = height * max;
     const wScale = 10;
     const visibleData = data.slice(-width / wScale - 1);

[Timeout] ArithmeticOperator
src/components/statistic/SimpleChart.tsx:25:36
     const max: number = maxValue ? maxValue : Math.max(...data);
     const hScale = height / max;
     const wScale = 10;
-    const visibleData = data.slice(-width / wScale - 1);
+    const visibleData = data.slice(-width / wScale + 1);
 
     const path = visibleData

[Timeout] ArithmeticOperator
src/components/statistic/SimpleChart.tsx:25:36
     const max: number = maxValue ? maxValue : Math.max(...data);
     const hScale = height / max;
     const wScale = 10;
-    const visibleData = data.slice(-width / wScale - 1);
+    const visibleData = data.slice(-width * wScale - 1);
 
     const path = visibleData

[Timeout] ConditionalExpression
src/components/statistic/SimpleChart.tsx:28:35
     const visibleData = data.slice(-width / wScale - 1);
 
     const path = visibleData
-        .map((value, index) => `${index === 0 ? "M" : "L"} ${index * wScale} ${(max - value) * hScale}`)
+        .map((value, index) => `${true ? "M" : "L"} ${index * wScale} ${(max - value) * hScale}`)
         .join(" ");
 

[Timeout] EqualityOperator
src/components/statistic/SimpleChart.tsx:28:35
     const visibleData = data.slice(-width / wScale - 1);
 
     const path = visibleData
-        .map((value, index) => `${index === 0 ? "M" : "L"} ${index * wScale} ${(max - value) * hScale}`)
+        .map((value, index) => `${index !== 0 ? "M" : "L"} ${index * wScale} ${(max - value) * hScale}`)
         .join(" ");
 
