[Timeout] ObjectLiteral
src/components/styled/Cell.stories.tsx:14:13
 const Template: ComponentStory<typeof Cell> = (args) => <Cell {...args} />;
 
 export const Dead = Template.bind({});
-Dead.args = {
-    state: "dead",
-};
+Dead.args = {};
 
 export const Young = Template.bind({});

[Timeout] StringLiteral
src/components/styled/Cell.stories.tsx:25:12
 
 export const Old = Template.bind({});
 Old.args = {
-    state: "old",
+    state: "",
 };
 
