[Timeout] ObjectLiteral
src/components/styled/Label.stories.tsx:14:14
 const Template: ComponentStory<typeof Label> = (args) => <Label {...args}>Label</Label>;
 
 export const Small = Template.bind({});
-Small.args = {
-    size: "small",
-};
+Small.args = {};
 
 export const Medium = Template.bind({});

[Timeout] ObjectLiteral
src/components/styled/Label.stories.tsx:24:14
 };
 
 export const Large = Template.bind({});
-Large.args = {
-    size: "large",
-};
+Large.args = {};
 

[Timeout] StringLiteral
src/components/styled/Label.stories.tsx:25:11
 
 export const Large = Template.bind({});
 Large.args = {
-    size: "large",
+    size: "",
 };
 
