[Timeout] BooleanLiteral
src/stories/Button.stories.tsx:22:14
 export const Primary = Template.bind({});
 // More on args: https://storybook.js.org/docs/react/writing-stories/args
 Primary.args = {
-    primary: true,
+    primary: false,
     label: "Button",
 };

[Timeout] StringLiteral
src/stories/Button.stories.tsx:34:12
 export const Large = Template.bind({});
 Large.args = {
     size: "large",
-    label: "Button",
+    label: "",
 };
 
