[Timeout] StringLiteral
src/components/styled/Label.tsx:8:12
 }
 
 const sizes = {
-    small: "12px",
+    small: "",
     medium: "16px",
     large: "24px",

[Timeout] StringLiteral
src/components/styled/Label.tsx:13:37
     large: "24px",
 };
 
-const Label = styled.div<LabelProps>`
-    color: #ddd;
-    font-size: ${({ size = "medium" }) => sizes[size]};
-    margin: auto;
-`;
+const Label = styled.div<LabelProps>``;
 
 export default Label;

[Timeout] ArrowFunction
src/components/styled/Label.tsx:15:18
 
 const Label = styled.div<LabelProps>`
     color: #ddd;
-    font-size: ${({ size = "medium" }) => sizes[size]};
+    font-size: ${() => undefined};
     margin: auto;
 `;
