[Timeout] BooleanLiteral
src/stories/Button.tsx:30:36
 /**
  * Primary UI component for user interaction
  */
-export const Button = ({ primary = false, size = "medium", backgroundColor, label, ...props }: ButtonProps) => {
+export const Button = ({ primary = true, size = "medium", backgroundColor, label, ...props }: ButtonProps) => {
     const mode = primary ? "storybook-button--primary" : "storybook-button--secondary";
     return (

[Timeout] StringLiteral
src/stories/Button.tsx:35:85
     return (
         <button
             type="button"
-            className={["storybook-button", `storybook-button--${size}`, mode].join(" ")}
+            className={["storybook-button", `storybook-button--${size}`, mode].join("")}
             style={{ backgroundColor }}
             {...props}
