[Timeout] BlockStatement
src/components/TextDialog.tsx:18:64
 
     const [value, setValue] = useState<string>("");
 
-    const onChange = (event: ChangeEvent<HTMLInputElement>) => {
-        setValue(event.target.value);
-    };
+    const onChange = (event: ChangeEvent<HTMLInputElement>) => {};
 
     const onEnter = (event: KeyboardEvent<HTMLInputElement>) => {

[Timeout] BlockStatement
src/components/TextDialog.tsx:22:65
         setValue(event.target.value);
     };
 
-    const onEnter = (event: KeyboardEvent<HTMLInputElement>) => {
-        if (event.key === "Enter") {
-            onOk(value);
-        }
-    };
+    const onEnter = (event: KeyboardEvent<HTMLInputElement>) => {};
 
     return (

[Timeout] BlockStatement
src/components/TextDialog.tsx:23:36
     };
 
     const onEnter = (event: KeyboardEvent<HTMLInputElement>) => {
-        if (event.key === "Enter") {
-            onOk(value);
-        }
+        if (event.key === "Enter") {}
     };
 

[Timeout] ConditionalExpression
src/components/TextDialog.tsx:23:13
     };
 
     const onEnter = (event: KeyboardEvent<HTMLInputElement>) => {
-        if (event.key === "Enter") {
+        if (false) {
             onOk(value);
         }

[Timeout] ArrowFunction
src/components/TextDialog.tsx:33:34
             <DialogContainer>
                 <Label size="large">{message}</Label>
                 <TextField value={value} onChange={onChange} onKeyUp={onEnter} />
-                <Button onClick={() => onOk(value)}>OK</Button>
+                <Button onClick={() => undefined}>OK</Button>
             </DialogContainer>
         </Overlay>
