[Timeout] ArrowFunction
src/components/styled/Button.tsx:8:25
 }
 
 const Button = styled.button<ButtonProps>`
-    background-color: ${(props) => (props.active ? "#faa" : "#222")};
+    background-color: ${() => undefined};
     color: ${(props) => (props.active ? "#222" : "#ddd")};
     transition: color 0.3s;

[Timeout] StringLiteral
src/components/styled/Button.tsx:8:52
 }
 
 const Button = styled.button<ButtonProps>`
-    background-color: ${(props) => (props.active ? "#faa" : "#222")};
+    background-color: ${(props) => (props.active ? "" : "#222")};
     color: ${(props) => (props.active ? "#222" : "#ddd")};
     transition: color 0.3s;

[Timeout] ArrowFunction
src/components/styled/Button.tsx:9:14
 
 const Button = styled.button<ButtonProps>`
     background-color: ${(props) => (props.active ? "#faa" : "#222")};
-    color: ${(props) => (props.active ? "#222" : "#ddd")};
+    color: ${() => undefined};
     transition: color 0.3s;
     transition: background-color 0.3s;
