[Timeout] StringLiteral
src/components/styled/GameFieldRow.tsx:3:32
 import styled from "styled-components";
 
-const GameFieldRow = styled.div`
-    display: flex;
-    flex-direction: row;
-`;
+const GameFieldRow = styled.div``;
 
 export default GameFieldRow;
