[Timeout] BlockStatement
src/pages/_document.tsx:3:36
 import { Html, Head, Main, NextScript } from "next/document";
 
-export default function Document() {
-    return (
-        <Html lang="en">
-            <Head />
-            <body>
-                <Main />
-                <NextScript />
-            </body>
-        </Html>
-    );
-}
+export default function Document() {}
 
