[Timeout] ArrayDeclaration
src/components/GameField.stories.tsx:15:12
 
 export const AllDead = Template.bind({});
 AllDead.args = {
-    field: [
-        [0, 0, 0, 0, 0],
-        [0, 0, 0, 0, 0],
-        [0, 0, 0, 0, 0],
-        [0, 0, 0, 0, 0],
-        [0, 0, 0, 0, 0],
-    ],
+    field: [],
 };
 

[Timeout] ArrayDeclaration
src/components/GameField.stories.tsx:17:9
 AllDead.args = {
     field: [
         [0, 0, 0, 0, 0],
-        [0, 0, 0, 0, 0],
+        [],
         [0, 0, 0, 0, 0],
         [0, 0, 0, 0, 0],

[Timeout] ObjectLiteral
src/components/GameField.stories.tsx:25:14
 };
 
 export const Chess = Template.bind({});
-Chess.args = {
-    field: [
-        [0, 1, 2, 0, 1],
-        [1, 2, 0, 1, 2],
-        [2, 0, 1, 2, 0],
-        [0, 1, 2, 0, 1],
-        [1, 2, 0, 1, 0],
-    ],
-};
+Chess.args = {};
 

[Timeout] ArrayDeclaration
src/components/GameField.stories.tsx:30:9
         [0, 1, 2, 0, 1],
         [1, 2, 0, 1, 2],
         [2, 0, 1, 2, 0],
-        [0, 1, 2, 0, 1],
+        [],
         [1, 2, 0, 1, 0],
     ],
