[Timeout] BooleanLiteral
src/utils/testUtils.tsx:19:28
     ui: React.ReactElement,
     {
         // Automatically create a store instance if no store was passed in
-        store = setupStore(true),
+        store = setupStore(false),
         ...renderOptions
     }: ExtendedRenderOptions = {}

[Timeout] BlockStatement
src/utils/testUtils.tsx:22:3
         store = setupStore(true),
         ...renderOptions
     }: ExtendedRenderOptions = {}
-) {
-    function Wrapper({ children }: PropsWithChildren<object>): JSX.Element {
-        return <Provider store={store}>{children}</Provider>;
-    }
-    return { store, ...render(ui, { wrapper: Wrapper, ...renderOptions }) };
-}
+) {}
 
