[Timeout] ArrowFunction
src/components/BottomMenu.tsx:23:30
     return (
         <BottomMenuContainer>
             <Label>Board Size:</Label>
-            <Button onClick={() => dispatch(setSize("50x30"))} active={size === "50x30"}>
+            <Button onClick={() => undefined} active={size === "50x30"}>
                 Size: 50x30
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:23:72
     return (
         <BottomMenuContainer>
             <Label>Board Size:</Label>
-            <Button onClick={() => dispatch(setSize("50x30"))} active={size === "50x30"}>
+            <Button onClick={() => dispatch(setSize("50x30"))} active={false}>
                 Size: 50x30
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:26:72
             <Button onClick={() => dispatch(setSize("50x30"))} active={size === "50x30"}>
                 Size: 50x30
             </Button>
-            <Button onClick={() => dispatch(setSize("70x50"))} active={size === "70x50"}>
+            <Button onClick={() => dispatch(setSize("70x50"))} active={false}>
                 Size: 70x50
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:26:72
             <Button onClick={() => dispatch(setSize("50x30"))} active={size === "50x30"}>
                 Size: 50x30
             </Button>
-            <Button onClick={() => dispatch(setSize("70x50"))} active={size === "70x50"}>
+            <Button onClick={() => dispatch(setSize("70x50"))} active={true}>
                 Size: 70x50
             </Button>

[Timeout] ArrowFunction
src/components/BottomMenu.tsx:29:30
             <Button onClick={() => dispatch(setSize("70x50"))} active={size === "70x50"}>
                 Size: 70x50
             </Button>
-            <Button onClick={() => dispatch(setSize("100x80"))} active={size === "100x80"}>
+            <Button onClick={() => undefined} active={size === "100x80"}>
                 Size: 100x80
             </Button>

[Timeout] EqualityOperator
src/components/BottomMenu.tsx:29:73
             <Button onClick={() => dispatch(setSize("70x50"))} active={size === "70x50"}>
                 Size: 70x50
             </Button>
-            <Button onClick={() => dispatch(setSize("100x80"))} active={size === "100x80"}>
+            <Button onClick={() => dispatch(setSize("100x80"))} active={size !== "100x80"}>
                 Size: 100x80
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:33:69
                 Size: 100x80
             </Button>
             <Label>Sim Speed:</Label>
-            <Button onClick={() => dispatch(setSpeed(600))} active={speed === 600}>
+            <Button onClick={() => dispatch(setSpeed(600))} active={true}>
                 Slow
             </Button>

[Timeout] ArrowFunction
src/components/BottomMenu.tsx:33:30
                 Size: 100x80
             </Button>
             <Label>Sim Speed:</Label>
-            <Button onClick={() => dispatch(setSpeed(600))} active={speed === 600}>
+            <Button onClick={() => undefined} active={speed === 600}>
                 Slow
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:36:69
             <Button onClick={() => dispatch(setSpeed(600))} active={speed === 600}>
                 Slow
             </Button>
-            <Button onClick={() => dispatch(setSpeed(400))} active={speed === 400}>
+            <Button onClick={() => dispatch(setSpeed(400))} active={true}>
                 Medium
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:36:69
             <Button onClick={() => dispatch(setSpeed(600))} active={speed === 600}>
                 Slow
             </Button>
-            <Button onClick={() => dispatch(setSpeed(400))} active={speed === 400}>
+            <Button onClick={() => dispatch(setSpeed(400))} active={false}>
                 Medium
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:39:69
             <Button onClick={() => dispatch(setSpeed(400))} active={speed === 400}>
                 Medium
             </Button>
-            <Button onClick={() => dispatch(setSpeed(200))} active={speed === 200}>
+            <Button onClick={() => dispatch(setSpeed(200))} active={true}>
                 Fast
             </Button>

[Timeout] ConditionalExpression
src/components/BottomMenu.tsx:39:69
             <Button onClick={() => dispatch(setSpeed(400))} active={speed === 400}>
                 Medium
             </Button>
-            <Button onClick={() => dispatch(setSpeed(200))} active={speed === 200}>
+            <Button onClick={() => dispatch(setSpeed(200))} active={false}>
                 Fast
             </Button>
