[Timeout] BooleanLiteral
src/components/BottomMenu.stories.tsx:13:26
     component: BottomMenu,
 } as ComponentMeta<typeof BottomMenu>;
 
-const store = setupStore(false);
+const store = setupStore(true);
 
 const Template: ComponentStory<typeof BottomMenu> = () => (
