[Timeout] BlockStatement
src/components/statistic/SessionChart.tsx:30:32
             <SimpleChart data={data} width={140} height={40} maxValue={100} {...props} />
             <MinMaxAvr data={data} />
             <Button
-                onClick={() => {
-                    dispatch(cleanSessionStatistic());
-                }}
+                onClick={() => {}}
             >
                 Clear
