[Timeout] StringLiteral
src/components/TopMenu.tsx:25:50
 `;
 
 const TopMenu = () => {
-    const [random, setRandom] = useState<string>("50%");
+    const [random, setRandom] = useState<string>("");
 
     const dispatch = useDispatch();

[Timeout] BlockStatement
src/components/TopMenu.tsx:32:73
     const mode = useSelector(modeSelector);
     const field = useSelector(lastGenerationSelector);
 
-    const onTextFieldChange = (event: ChangeEvent<HTMLInputElement>) => {
-        setRandom(event.target.value);
-    };
+    const onTextFieldChange = (event: ChangeEvent<HTMLInputElement>) => {};
 
     const matchResult: string | undefined = random.match(/^\d+%?$/)?.[0];

[Timeout] Regex
src/components/TopMenu.tsx:36:58
         setRandom(event.target.value);
     };
 
-    const matchResult: string | undefined = random.match(/^\d+%?$/)?.[0];
+    const matchResult: string | undefined = random.match(/^\d+%?/)?.[0];
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
     const validRandom = randomValue <= 100;

[Timeout] Regex
src/components/TopMenu.tsx:36:58
         setRandom(event.target.value);
     };
 
-    const matchResult: string | undefined = random.match(/^\d+%?$/)?.[0];
+    const matchResult: string | undefined = random.match(/^\d%?$/)?.[0];
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
     const validRandom = randomValue <= 100;

[Timeout] EqualityOperator
src/components/TopMenu.tsx:38:25
 
     const matchResult: string | undefined = random.match(/^\d+%?$/)?.[0];
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
-    const validRandom = randomValue <= 100;
+    const validRandom = randomValue > 100;
 
     const onRandomButtonClick = () => {

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:38:25
 
     const matchResult: string | undefined = random.match(/^\d+%?$/)?.[0];
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
-    const validRandom = randomValue <= 100;
+    const validRandom = false;
 
     const onRandomButtonClick = () => {

[Timeout] BlockStatement
src/components/TopMenu.tsx:40:39
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
     const validRandom = randomValue <= 100;
 
-    const onRandomButtonClick = () => {
-        if (validRandom) {
-            if (mode === "pause") {
-                dispatch(setGen([generateField(field.width, field.height, randomValue)]));
-            }
-        }
-    };
+    const onRandomButtonClick = () => {};
 
     return (

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:41:13
     const validRandom = randomValue <= 100;
 
     const onRandomButtonClick = () => {
-        if (validRandom) {
+        if (false) {
             if (mode === "pause") {
                 dispatch(setGen([generateField(field.width, field.height, randomValue)]));

[Timeout] BlockStatement
src/components/TopMenu.tsx:41:26
     const validRandom = randomValue <= 100;
 
     const onRandomButtonClick = () => {
-        if (validRandom) {
-            if (mode === "pause") {
-                dispatch(setGen([generateField(field.width, field.height, randomValue)]));
-            }
-        }
+        if (validRandom) {}
     };
 

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:42:17
 
     const onRandomButtonClick = () => {
         if (validRandom) {
-            if (mode === "pause") {
+            if (false) {
                 dispatch(setGen([generateField(field.width, field.height, randomValue)]));
             }

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:42:17
 
     const onRandomButtonClick = () => {
         if (validRandom) {
-            if (mode === "pause") {
+            if (true) {
                 dispatch(setGen([generateField(field.width, field.height, randomValue)]));
             }

[Timeout] ArrayDeclaration
src/components/TopMenu.tsx:43:33
     const onRandomButtonClick = () => {
         if (validRandom) {
             if (mode === "pause") {
-                dispatch(setGen([generateField(field.width, field.height, randomValue)]));
+                dispatch(setGen([]));
             }
         }

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:50:70
 
     return (
         <TopMenuContainer>
-            <Button onClick={() => dispatch(setMode("run"))} active={mode === "run"}>
+            <Button onClick={() => dispatch(setMode("run"))} active={false}>
                 Run
             </Button>

[Timeout] ArrowFunction
src/components/TopMenu.tsx:50:30
 
     return (
         <TopMenuContainer>
-            <Button onClick={() => dispatch(setMode("run"))} active={mode === "run"}>
+            <Button onClick={() => undefined} active={mode === "run"}>
                 Run
             </Button>

[Timeout] EqualityOperator
src/components/TopMenu.tsx:53:72
             <Button onClick={() => dispatch(setMode("run"))} active={mode === "run"}>
                 Run
             </Button>
-            <Button onClick={() => dispatch(setMode("pause"))} active={mode === "pause"}>
+            <Button onClick={() => dispatch(setMode("pause"))} active={mode !== "pause"}>
                 Pause
             </Button>

[Timeout] ArrowFunction
src/components/TopMenu.tsx:53:30
             <Button onClick={() => dispatch(setMode("run"))} active={mode === "run"}>
                 Run
             </Button>
-            <Button onClick={() => dispatch(setMode("pause"))} active={mode === "pause"}>
+            <Button onClick={() => undefined} active={mode === "pause"}>
                 Pause
             </Button>

[Timeout] ArrowFunction
src/components/TopMenu.tsx:56:30
             <Button onClick={() => dispatch(setMode("pause"))} active={mode === "pause"}>
                 Pause
             </Button>
-            <Button onClick={() => dispatch(clean())}>Clear</Button>
+            <Button onClick={() => undefined}>Clear</Button>
             <Label>Generation: {field.generation}</Label>
             <Label>Random generation: </Label>

[Timeout] BooleanLiteral
src/components/TopMenu.tsx:59:75
             <Button onClick={() => dispatch(clean())}>Clear</Button>
             <Label>Generation: {field.generation}</Label>
             <Label>Random generation: </Label>
-            <TextField value={random} onChange={onTextFieldChange} error={!validRandom} />
+            <TextField value={random} onChange={onTextFieldChange} error={validRandom} />
             <Button onClick={onRandomButtonClick}>Generate</Button>
             <ProfileContainer>

[Timeout] ArrowFunction
src/components/TopMenu.tsx:63:40
             <Button onClick={onRandomButtonClick}>Generate</Button>
             <ProfileContainer>
                 <Label>{playerName}</Label>
-                <LogoutButton onClick={() => dispatch(logout())} id="logout_button" />
+                <LogoutButton onClick={() => undefined} id="logout_button" />
             </ProfileContainer>
         </TopMenuContainer>
