[Timeout] StringLiteral
src/components/styled/TextField.tsx:7:47
     error?: boolean;
 }
 
-const TextField = styled.input<TextFieldProps>`
-    background-color: ${(props) => (props.error ? "#faa" : "#222")};
-    color: ${(props) => (props.error ? "#222" : "#ddd")};
-    transition: color 0.3s;
-    transition: background-color 0.3s;
-    display: inline-block;
-    width: 132px;
-    height: 22px;
-    font-size: 16px;
-    border-radius: 5px;
-`;
+const TextField = styled.input<TextFieldProps>``;
 
 export default TextField;

[Timeout] ArrowFunction
src/components/styled/TextField.tsx:8:25
 }
 
 const TextField = styled.input<TextFieldProps>`
-    background-color: ${(props) => (props.error ? "#faa" : "#222")};
+    background-color: ${() => undefined};
     color: ${(props) => (props.error ? "#222" : "#ddd")};
     transition: color 0.3s;

[Timeout] ArrowFunction
src/components/styled/TextField.tsx:9:14
 
 const TextField = styled.input<TextFieldProps>`
     background-color: ${(props) => (props.error ? "#faa" : "#222")};
-    color: ${(props) => (props.error ? "#222" : "#ddd")};
+    color: ${() => undefined};
     transition: color 0.3s;
     transition: background-color 0.3s;

[Timeout] StringLiteral
src/components/styled/TextField.tsx:9:49
 
 const TextField = styled.input<TextFieldProps>`
     background-color: ${(props) => (props.error ? "#faa" : "#222")};
-    color: ${(props) => (props.error ? "#222" : "#ddd")};
+    color: ${(props) => (props.error ? "#222" : "")};
     transition: color 0.3s;
     transition: background-color 0.3s;
