[Timeout] ArrowFunction
src/components/GameField.tsx:27:24
 
     return (
         <GameFieldContainer>
-            {field.map((row, i) => (
-                <GameFieldRow key={i}>
-                    {row.map((cell, j) => (
-                        <Cell
-                            key={j}
-                            state={getCellStateByFieldCell(cell)}
-                            onClick={() => {
-                                onCellClick(i, j);
-                            }}
-                        />
-                    ))}
-                </GameFieldRow>
-            ))}
+            {field.map(() => undefined)}
         </GameFieldContainer>
     );

[Timeout] ArrowFunction
src/components/GameField.tsx:29:30
         <GameFieldContainer>
             {field.map((row, i) => (
                 <GameFieldRow key={i}>
-                    {row.map((cell, j) => (
-                        <Cell
-                            key={j}
-                            state={getCellStateByFieldCell(cell)}
-                            onClick={() => {
-                                onCellClick(i, j);
-                            }}
-                        />
-                    ))}
+                    {row.map(() => undefined)}
                 </GameFieldRow>
             ))}

[Timeout] BlockStatement
src/components/GameField.tsx:33:44
                         <Cell
                             key={j}
                             state={getCellStateByFieldCell(cell)}
-                            onClick={() => {
-                                onCellClick(i, j);
-                            }}
+                            onClick={() => {}}
                         />
                     ))}
