[Timeout] StringLiteral
src/components/styled/Cell.tsx:8:11
 }
 
 const bgColors = {
-    dead: "#aaa",
+    dead: "",
     young: "#f22",
     old: "#a22",

[Timeout] StringLiteral
src/components/styled/Cell.tsx:9:12
 
 const bgColors = {
     dead: "#aaa",
-    young: "#f22",
+    young: "",
     old: "#a22",
 };

[Timeout] StringLiteral
src/components/styled/Cell.tsx:13:35
     old: "#a22",
 };
 
-const Cell = styled.div<CellProps>`
-    background-color: ${(props) => bgColors[props.state]};
-    border: solid 1px #000;
-    width: 10px;
-    height: 10px;
-    transition: background-color 1s;
-`;
+const Cell = styled.div<CellProps>``;
 
 export default Cell;

[Timeout] ArrowFunction
src/components/styled/Cell.tsx:14:25
 };
 
 const Cell = styled.div<CellProps>`
-    background-color: ${(props) => bgColors[props.state]};
+    background-color: ${() => undefined};
     border: solid 1px #000;
     width: 10px;
