[Timeout] BlockStatement
src/pages/game.tsx:31:21
     const dispatch = useDispatch();
     const router = useRouter();
 
-    useEffect(() => {
-        !isLogin && router.push("/");
-    }, [isLogin, router]);
+    useEffect(() => {}, [isLogin, router]);
 
     const onCellClick = (x: number, y: number) => {

[Timeout] LogicalOperator
src/pages/game.tsx:32:9
     const router = useRouter();
 
     useEffect(() => {
-        !isLogin && router.push("/");
+        !isLogin || router.push("/");
     }, [isLogin, router]);
 

[Timeout] ConditionalExpression
src/pages/game.tsx:32:9
     const router = useRouter();
 
     useEffect(() => {
-        !isLogin && router.push("/");
+        false;
     }, [isLogin, router]);
 

[Timeout] ArrayDeclaration
src/pages/game.tsx:33:8
 
     useEffect(() => {
         !isLogin && router.push("/");
-    }, [isLogin, router]);
+    }, []);
 
     const onCellClick = (x: number, y: number) => {

[Timeout] BlockStatement
src/pages/game.tsx:35:51
         !isLogin && router.push("/");
     }, [isLogin, router]);
 
-    const onCellClick = (x: number, y: number) => {
-        if (mode === "pause") {
-            const fieldData = field.data.map((row, i) =>
-                row.map((cell, j) => (i === x && j === y ? (cell > 0 ? 0 : 1) : cell))
-            );
-            dispatch(modGen({ ...field, data: fieldData }));
-        }
-    };
+    const onCellClick = (x: number, y: number) => {};
 
     useEffect(() => {

[Timeout] EqualityOperator
src/pages/game.tsx:36:13
     }, [isLogin, router]);
 
     const onCellClick = (x: number, y: number) => {
-        if (mode === "pause") {
+        if (mode !== "pause") {
             const fieldData = field.data.map((row, i) =>
                 row.map((cell, j) => (i === x && j === y ? (cell > 0 ? 0 : 1) : cell))

[Timeout] BlockStatement
src/pages/game.tsx:36:31
     }, [isLogin, router]);
 
     const onCellClick = (x: number, y: number) => {
-        if (mode === "pause") {
-            const fieldData = field.data.map((row, i) =>
-                row.map((cell, j) => (i === x && j === y ? (cell > 0 ? 0 : 1) : cell))
-            );
-            dispatch(modGen({ ...field, data: fieldData }));
-        }
+        if (mode === "pause") {}
     };
 

[Timeout] EqualityOperator
src/pages/game.tsx:38:61
     const onCellClick = (x: number, y: number) => {
         if (mode === "pause") {
             const fieldData = field.data.map((row, i) =>
-                row.map((cell, j) => (i === x && j === y ? (cell > 0 ? 0 : 1) : cell))
+                row.map((cell, j) => (i === x && j === y ? (cell <= 0 ? 0 : 1) : cell))
             );
             dispatch(modGen({ ...field, data: fieldData }));

[Timeout] EqualityOperator
src/pages/game.tsx:38:39
     const onCellClick = (x: number, y: number) => {
         if (mode === "pause") {
             const fieldData = field.data.map((row, i) =>
-                row.map((cell, j) => (i === x && j === y ? (cell > 0 ? 0 : 1) : cell))
+                row.map((cell, j) => (i !== x && j === y ? (cell > 0 ? 0 : 1) : cell))
             );
             dispatch(modGen({ ...field, data: fieldData }));

[Timeout] BlockStatement
src/pages/game.tsx:44:21
         }
     };
 
-    useEffect(() => {
-        if (mode === "run") {
-            const interval = setInterval(() => {
-                const nextGen = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextGen.data)) {
-                    dispatch(setMode("pause"));
-                } else {
-                    dispatch(addGen(nextGen));
-                }
-            }, speed);
-            return () => clearTimeout(interval);
-        }
-    }, [mode, speed, field, dispatch]);
+    useEffect(() => {}, [mode, speed, field, dispatch]);
 
     return (

[Timeout] ConditionalExpression
src/pages/game.tsx:45:13
     };
 
     useEffect(() => {
-        if (mode === "run") {
+        if (false) {
             const interval = setInterval(() => {
                 const nextGen = generateNextGeneration(field);

[Timeout] BlockStatement
src/pages/game.tsx:45:29
     };
 
     useEffect(() => {
-        if (mode === "run") {
-            const interval = setInterval(() => {
-                const nextGen = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextGen.data)) {
-                    dispatch(setMode("pause"));
-                } else {
-                    dispatch(addGen(nextGen));
-                }
-            }, speed);
-            return () => clearTimeout(interval);
-        }
+        if (mode === "run") {}
     }, [mode, speed, field, dispatch]);
 

[Timeout] BlockStatement
src/pages/game.tsx:46:48
 
     useEffect(() => {
         if (mode === "run") {
-            const interval = setInterval(() => {
-                const nextGen = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextGen.data)) {
-                    dispatch(setMode("pause"));
-                } else {
-                    dispatch(addGen(nextGen));
-                }
-            }, speed);
+            const interval = setInterval(() => {}, speed);
             return () => clearTimeout(interval);
         }

[Timeout] ConditionalExpression
src/pages/game.tsx:48:21
         if (mode === "run") {
             const interval = setInterval(() => {
                 const nextGen = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextGen.data)) {
+                if (false) {
                     dispatch(setMode("pause"));
                 } else {

[Timeout] BlockStatement
src/pages/game.tsx:48:60
         if (mode === "run") {
             const interval = setInterval(() => {
                 const nextGen = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextGen.data)) {
-                    dispatch(setMode("pause"));
-                } else {
+                if (equalMatrix(field.data, nextGen.data)) {} else {
                     dispatch(addGen(nextGen));
                 }

[Timeout] BlockStatement
src/pages/game.tsx:50:24
                 const nextGen = generateNextGeneration(field);
                 if (equalMatrix(field.data, nextGen.data)) {
                     dispatch(setMode("pause"));
-                } else {
-                    dispatch(addGen(nextGen));
-                }
+                } else {}
             }, speed);
             return () => clearTimeout(interval);

[Timeout] ArrowFunction
src/pages/game.tsx:54:20
                     dispatch(addGen(nextGen));
                 }
             }, speed);
-            return () => clearTimeout(interval);
+            return () => undefined;
         }
     }, [mode, speed, field, dispatch]);

[Timeout] ArrayDeclaration
src/pages/game.tsx:56:8
             }, speed);
             return () => clearTimeout(interval);
         }
-    }, [mode, speed, field, dispatch]);
+    }, []);
 
     return (
