[Timeout] StringLiteral
src/store/gameReduser.ts:12:14
 const SET_GEN = "src/store/gameReduser/SET_GEN";
 export const ADD_GEN = "src/store/gameReduser/ADD_GEN";
 const MOD_GEN = "src/store/gameReduser/MOD_GEN";
-const SIZE = "src/store/gameReduser/SIZE";
+const SIZE = "";
 const SPEED = "src/store/gameReduser/SPEED";
 const MODE = "src/store/gameReduser/MODE";

[Timeout] StringLiteral
src/store/gameReduser.ts:13:15
 export const ADD_GEN = "src/store/gameReduser/ADD_GEN";
 const MOD_GEN = "src/store/gameReduser/MOD_GEN";
 const SIZE = "src/store/gameReduser/SIZE";
-const SPEED = "src/store/gameReduser/SPEED";
+const SPEED = "";
 const MODE = "src/store/gameReduser/MODE";
 const CLEAN = "src/store/gameReduser/CLEAN";

[Timeout] StringLiteral
src/store/gameReduser.ts:14:14
 const MOD_GEN = "src/store/gameReduser/MOD_GEN";
 const SIZE = "src/store/gameReduser/SIZE";
 const SPEED = "src/store/gameReduser/SPEED";
-const MODE = "src/store/gameReduser/MODE";
+const MODE = "";
 const CLEAN = "src/store/gameReduser/CLEAN";
 

[Timeout] ConditionalExpression
src/store/gameReduser.ts:68:9
     switch (action.type) {
         case SET_GEN:
             return { ...state, generations: action.generations };
-        case ADD_GEN:
-            return { ...state, generations: [...state.generations, action.field] };
+        case ADD_GEN:
         case MOD_GEN:
             const generations = [...state.generations.slice(0, state.generations.length - 1), action.field];

[Timeout] ArrayDeclaration
src/store/gameReduser.ts:69:45
         case SET_GEN:
             return { ...state, generations: action.generations };
         case ADD_GEN:
-            return { ...state, generations: [...state.generations, action.field] };
+            return { ...state, generations: [] };
         case MOD_GEN:
             const generations = [...state.generations.slice(0, state.generations.length - 1), action.field];

[Timeout] MethodExpression
src/store/gameReduser.ts:71:37
         case ADD_GEN:
             return { ...state, generations: [...state.generations, action.field] };
         case MOD_GEN:
-            const generations = [...state.generations.slice(0, state.generations.length - 1), action.field];
+            const generations = [...state.generations, action.field];
             return { ...state, generations };
         case SIZE:

[Timeout] ArithmeticOperator
src/store/gameReduser.ts:71:64
         case ADD_GEN:
             return { ...state, generations: [...state.generations, action.field] };
         case MOD_GEN:
-            const generations = [...state.generations.slice(0, state.generations.length - 1), action.field];
+            const generations = [...state.generations.slice(0, state.generations.length + 1), action.field];
             return { ...state, generations };
         case SIZE:

[Timeout] StringLiteral
src/store/gameReduser.ts:74:55
             const generations = [...state.generations.slice(0, state.generations.length - 1), action.field];
             return { ...state, generations };
         case SIZE:
-            const [width, height] = action.size.split("x").map((item) => parseInt(item));
+            const [width, height] = action.size.split("").map((item) => parseInt(item));
             const field = generateFieldByField(width, height, state.generations[state.generations.length - 1]);
             return { ...state, generations: [field], size: action.size };

[Timeout] ArithmeticOperator
src/store/gameReduser.ts:75:81
             return { ...state, generations };
         case SIZE:
             const [width, height] = action.size.split("x").map((item) => parseInt(item));
-            const field = generateFieldByField(width, height, state.generations[state.generations.length - 1]);
+            const field = generateFieldByField(width, height, state.generations[state.generations.length + 1]);
             return { ...state, generations: [field], size: action.size };
         case SPEED:

[Timeout] ArrayDeclaration
src/store/gameReduser.ts:76:45
         case SIZE:
             const [width, height] = action.size.split("x").map((item) => parseInt(item));
             const field = generateFieldByField(width, height, state.generations[state.generations.length - 1]);
-            return { ...state, generations: [field], size: action.size };
+            return { ...state, generations: [], size: action.size };
         case SPEED:
             return { ...state, speed: action.speed };

[Timeout] ConditionalExpression
src/store/gameReduser.ts:79:9
             return { ...state, generations: [field], size: action.size };
         case SPEED:
             return { ...state, speed: action.speed };
-        case MODE:
-            return { ...state, mode: action.mode };
+        case MODE:
         case CLEAN:
             return { ...initState };

[Timeout] ConditionalExpression
src/store/gameReduser.ts:81:9
             return { ...state, speed: action.speed };
         case MODE:
             return { ...state, mode: action.mode };
-        case CLEAN:
-            return { ...initState };
+        case CLEAN:
         default:
             return state;

[Timeout] ArithmeticOperator
src/store/gameReduser.ts:112:43
 
 export const lastGenerationSelector = createSelector(
     (state: RootState) => state.game,
-    (game: GameState) => game.generations[game.generations.length - 1]
+    (game: GameState) => game.generations[game.generations.length + 1]
 );
 export const sizeSelector = createSelector(

[Timeout] ArrowFunction
src/store/gameReduser.ts:116:5
 );
 export const sizeSelector = createSelector(
     (state: RootState) => state.game,
-    (game: GameState) => game.size
+    () => undefined
 );
 export const speedSelector = createSelector(

[Timeout] ArrowFunction
src/store/gameReduser.ts:120:5
 );
 export const speedSelector = createSelector(
     (state: RootState) => state.game,
-    (game: GameState) => game.speed
+    () => undefined
 );
 export const modeSelector = createSelector(

[Timeout] ArrowFunction
src/store/gameReduser.ts:124:5
 );
 export const modeSelector = createSelector(
     (state: RootState) => state.game,
-    (game: GameState) => game.mode
+    () => undefined
 );
 

[Timeout] BlockStatement
src/store/gameReduser.ts:127:76
     (game: GameState) => game.mode
 );
 
-function* onAddGen(action: AddGenAction): Generator<PutEffect, void, void> {
-    const field = action.field;
-    const sum = field.data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b > 0 ? 1 : 0)), 0);
-    yield put(addGameStat(sum));
-    yield put(updateSessionStat((sum / (field.width * field.height)) * 100));
-}
+function* onAddGen(action: AddGenAction): Generator<PutEffect, void, void> {}
 
 export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {

[Timeout] EqualityOperator
src/store/gameReduser.ts:129:81
 
 function* onAddGen(action: AddGenAction): Generator<PutEffect, void, void> {
     const field = action.field;
-    const sum = field.data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b > 0 ? 1 : 0)), 0);
+    const sum = field.data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b <= 0 ? 1 : 0)), 0);
     yield put(addGameStat(sum));
     yield put(updateSessionStat((sum / (field.width * field.height)) * 100));

[Timeout] ArithmeticOperator
src/store/gameReduser.ts:129:49
 
 function* onAddGen(action: AddGenAction): Generator<PutEffect, void, void> {
     const field = action.field;
-    const sum = field.data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b > 0 ? 1 : 0)), 0);
+    const sum = field.data.reduce((sum, row) => sum - row.reduce((a, b) => a + (b > 0 ? 1 : 0)), 0);
     yield put(addGameStat(sum));
     yield put(updateSessionStat((sum / (field.width * field.height)) * 100));

[Timeout] ArithmeticOperator
src/store/gameReduser.ts:131:33
     const field = action.field;
     const sum = field.data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b > 0 ? 1 : 0)), 0);
     yield put(addGameStat(sum));
-    yield put(updateSessionStat((sum / (field.width * field.height)) * 100));
+    yield put(updateSessionStat(sum / (field.width * field.height) / 100));
 }
 

[Timeout] ArithmeticOperator
src/store/gameReduser.ts:131:34
     const field = action.field;
     const sum = field.data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b > 0 ? 1 : 0)), 0);
     yield put(addGameStat(sum));
-    yield put(updateSessionStat((sum / (field.width * field.height)) * 100));
+    yield put(updateSessionStat((sum * (field.width * field.height)) * 100));
 }
 

[Timeout] BlockStatement
src/store/gameReduser.ts:134:85
     yield put(updateSessionStat((sum / (field.width * field.height)) * 100));
 }
 
-export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {
-    yield takeEvery(ADD_GEN, onAddGen);
-    yield takeEvery(CLEAN, function* () {
-        yield put(cleanGameStatistic());
-        yield put(fixSessionStat());
-    });
-}
+export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {}
 

[Timeout] BlockStatement
src/store/gameReduser.ts:136:41
 
 export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {
     yield takeEvery(ADD_GEN, onAddGen);
-    yield takeEvery(CLEAN, function* () {
-        yield put(cleanGameStatistic());
-        yield put(fixSessionStat());
-    });
+    yield takeEvery(CLEAN, function* () {});
 }
 
