[Timeout] StringLiteral
src/store/sessionReduser.ts:6:15
 import { createSelector } from "@reduxjs/toolkit";
 import { call, CallEffect, ForkEffect, put, PutEffect, takeEvery } from "redux-saga/effects";
 
-const LOGIN = "src/store/sessionReduser/LOGIN";
+const LOGIN = "";
 const LOGOUT = "src/store/sessionReduser/LOGOUT";
 

[Timeout] BooleanLiteral
src/store/sessionReduser.ts:26:14
 }
 
 const initState: SessionState = {
-    isLogin: false,
+    isLogin: true,
 };
 

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:31:9
 
 export default function reducer(state: SessionState = initState, action: Action): SessionState {
     switch (action.type) {
-        case LOGIN:
-            return { ...state, isLogin: true, playerName: action.playerName };
+        case LOGIN:
         case LOGOUT:
             return initState;

[Timeout] BooleanLiteral
src/store/sessionReduser.ts:32:41
 export default function reducer(state: SessionState = initState, action: Action): SessionState {
     switch (action.type) {
         case LOGIN:
-            return { ...state, isLogin: true, playerName: action.playerName };
+            return { ...state, isLogin: false, playerName: action.playerName };
         case LOGOUT:
             return initState;

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:33:9
     switch (action.type) {
         case LOGIN:
             return { ...state, isLogin: true, playerName: action.playerName };
-        case LOGOUT:
-            return initState;
+        case LOGOUT:
         default:
             return state;

[Timeout] ArrowFunction
src/store/sessionReduser.ts:49:5
 
 export const playerNameSelector = createSelector(
     (state: RootState) => state.session,
-    (session: SessionState) => session.playerName
+    () => undefined
 );
 export const loginSelector = createSelector(

[Timeout] ArrowFunction
src/store/sessionReduser.ts:53:5
 );
 export const loginSelector = createSelector(
     (state: RootState) => state.session,
-    (session: SessionState) => session.isLogin
+    () => undefined
 );
 

[Timeout] ArrowFunction
src/store/sessionReduser.ts:56:38
     (session: SessionState) => session.isLogin
 );
 
-export const getNameFromLocalStore = (): string | null | false =>
-    typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
+export const getNameFromLocalStore = () => undefined;
 export const setNameToLocalStore = (name: string) =>
     typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:57:5
 );
 
 export const getNameFromLocalStore = (): string | null | false =>
-    typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
+    true && localStorage.getItem(PLAYER_NAME_KEY);
 export const setNameToLocalStore = (name: string) =>
     typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:57:5
 );
 
 export const getNameFromLocalStore = (): string | null | false =>
-    typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
+    false;
 export const setNameToLocalStore = (name: string) =>
     typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:59:5
 export const getNameFromLocalStore = (): string | null | false =>
     typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
 export const setNameToLocalStore = (name: string) =>
-    typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);
+    true;
 export const cleanLocalStore = () => typeof window !== "undefined" && localStorage.removeItem(PLAYER_NAME_KEY);
 

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:59:5
 export const getNameFromLocalStore = (): string | null | false =>
     typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
 export const setNameToLocalStore = (name: string) =>
-    typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);
+    true && localStorage.setItem(PLAYER_NAME_KEY, name);
 export const cleanLocalStore = () => typeof window !== "undefined" && localStorage.removeItem(PLAYER_NAME_KEY);
 

[Timeout] ConditionalExpression
src/store/sessionReduser.ts:60:38
     typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
 export const setNameToLocalStore = (name: string) =>
     typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);
-export const cleanLocalStore = () => typeof window !== "undefined" && localStorage.removeItem(PLAYER_NAME_KEY);
+export const cleanLocalStore = () => false;
 
 function* onLogin(action: LoginAction): Generator<CallEffect, void, void> {

[Timeout] ArrowFunction
src/store/sessionReduser.ts:60:32
     typeof window !== "undefined" && localStorage.getItem(PLAYER_NAME_KEY);
 export const setNameToLocalStore = (name: string) =>
     typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);
-export const cleanLocalStore = () => typeof window !== "undefined" && localStorage.removeItem(PLAYER_NAME_KEY);
+export const cleanLocalStore = () => undefined;
 
 function* onLogin(action: LoginAction): Generator<CallEffect, void, void> {

[Timeout] BlockStatement
src/store/sessionReduser.ts:62:75
     typeof window !== "undefined" && localStorage.setItem(PLAYER_NAME_KEY, name);
 export const cleanLocalStore = () => typeof window !== "undefined" && localStorage.removeItem(PLAYER_NAME_KEY);
 
-function* onLogin(action: LoginAction): Generator<CallEffect, void, void> {
-    yield call(setNameToLocalStore, action.playerName);
-}
+function* onLogin(action: LoginAction): Generator<CallEffect, void, void> {}
 
 function* onLogout(): Generator<CallEffect, void, void> {

[Timeout] BlockStatement
src/store/sessionReduser.ts:66:57
     yield call(setNameToLocalStore, action.playerName);
 }
 
-function* onLogout(): Generator<CallEffect, void, void> {
-    yield call(cleanLocalStore);
-}
+function* onLogout(): Generator<CallEffect, void, void> {}
 
 export function* loginSaga(): Generator<CallEffect | PutEffect | ForkEffect, void, string | null> {

[Timeout] BlockStatement
src/store/sessionReduser.ts:70:99
     yield call(cleanLocalStore);
 }
 
-export function* loginSaga(): Generator<CallEffect | PutEffect | ForkEffect, void, string | null> {
-    const name = yield call(getNameFromLocalStore);
-    if (name) {
-        yield put(login(name));
-    }
-    yield takeEvery(LOGIN, onLogin);
-    yield takeEvery(LOGOUT, onLogout);
-}
+export function* loginSaga(): Generator<CallEffect | PutEffect | ForkEffect, void, string | null> {}
 

[Timeout] BlockStatement
src/store/sessionReduser.ts:72:15
 
 export function* loginSaga(): Generator<CallEffect | PutEffect | ForkEffect, void, string | null> {
     const name = yield call(getNameFromLocalStore);
-    if (name) {
-        yield put(login(name));
-    }
+    if (name) {}
     yield takeEvery(LOGIN, onLogin);
     yield takeEvery(LOGOUT, onLogout);
