[Timeout] StringLiteral
src/store/statisticReduser.ts:4:23
 import { RootState } from "@/store";
 import { createSelector } from "@reduxjs/toolkit";
 
-const ADD_GAME_STAT = "src/store/staticticReduser/ADD_GAME_STAT";
+const ADD_GAME_STAT = "";
 const CLEAN_GAME_STAT = "src/store/staticticReduser/CLEAN_GAME_STAT";
 const FIX_SESSION_STAT = "src/store/staticticReduser/FIX_SESSION_STAT";

[Timeout] StringLiteral
src/store/statisticReduser.ts:5:25
 import { createSelector } from "@reduxjs/toolkit";
 
 const ADD_GAME_STAT = "src/store/staticticReduser/ADD_GAME_STAT";
-const CLEAN_GAME_STAT = "src/store/staticticReduser/CLEAN_GAME_STAT";
+const CLEAN_GAME_STAT = "";
 const FIX_SESSION_STAT = "src/store/staticticReduser/FIX_SESSION_STAT";
 const UPDATE_SESSION_STAT = "src/store/staticticReduser/UPDATE_SESSION_STAT";

[Timeout] StringLiteral
src/store/statisticReduser.ts:6:26
 
 const ADD_GAME_STAT = "src/store/staticticReduser/ADD_GAME_STAT";
 const CLEAN_GAME_STAT = "src/store/staticticReduser/CLEAN_GAME_STAT";
-const FIX_SESSION_STAT = "src/store/staticticReduser/FIX_SESSION_STAT";
+const FIX_SESSION_STAT = "";
 const UPDATE_SESSION_STAT = "src/store/staticticReduser/UPDATE_SESSION_STAT";
 const CLEAN_SESSION_STAT = "src/store/staticticReduser/CLEAN_SESSION_STAT";

[Timeout] StringLiteral
src/store/statisticReduser.ts:7:29
 const ADD_GAME_STAT = "src/store/staticticReduser/ADD_GAME_STAT";
 const CLEAN_GAME_STAT = "src/store/staticticReduser/CLEAN_GAME_STAT";
 const FIX_SESSION_STAT = "src/store/staticticReduser/FIX_SESSION_STAT";
-const UPDATE_SESSION_STAT = "src/store/staticticReduser/UPDATE_SESSION_STAT";
+const UPDATE_SESSION_STAT = "";
 const CLEAN_SESSION_STAT = "src/store/staticticReduser/CLEAN_SESSION_STAT";
 

[Timeout] BooleanLiteral
src/store/statisticReduser.ts:43:23
 const initState: StatisticState = {
     gameStat: [],
     sessionStat: [],
-    lastSessionFixed: false,
+    lastSessionFixed: true,
 };
 

[Timeout] ConditionalExpression
src/store/statisticReduser.ts:48:9
 
 export default function reducer(state: StatisticState = initState, action: Action): StatisticState {
     switch (action.type) {
-        case ADD_GAME_STAT:
-            return { ...state, gameStat: [...state.gameStat, action.gameResult] };
+        case ADD_GAME_STAT:
         case CLEAN_GAME_STAT:
             return { ...state, gameStat: [] };

[Timeout] ConditionalExpression
src/store/statisticReduser.ts:50:9
     switch (action.type) {
         case ADD_GAME_STAT:
             return { ...state, gameStat: [...state.gameStat, action.gameResult] };
-        case CLEAN_GAME_STAT:
-            return { ...state, gameStat: [] };
+        case CLEAN_GAME_STAT:
         case FIX_SESSION_STAT:
             return { ...state, lastSessionFixed: true };

[Timeout] BooleanLiteral
src/store/statisticReduser.ts:53:50
         case CLEAN_GAME_STAT:
             return { ...state, gameStat: [] };
         case FIX_SESSION_STAT:
-            return { ...state, lastSessionFixed: true };
+            return { ...state, lastSessionFixed: false };
         case UPDATE_SESSION_STAT:
             const fixedSessions = state.lastSessionFixed

[Timeout] ConditionalExpression
src/store/statisticReduser.ts:54:9
             return { ...state, gameStat: [] };
         case FIX_SESSION_STAT:
             return { ...state, lastSessionFixed: true };
-        case UPDATE_SESSION_STAT:
-            const fixedSessions = state.lastSessionFixed
-                ? state.sessionStat
-                : [...state.sessionStat.slice(0, state.sessionStat.length - 1)];
-            return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: false };
+        case UPDATE_SESSION_STAT:
         case CLEAN_SESSION_STAT:
             return { ...state, sessionStat: [], lastSessionFixed: false };

[Timeout] MethodExpression
src/store/statisticReduser.ts:57:23
         case UPDATE_SESSION_STAT:
             const fixedSessions = state.lastSessionFixed
                 ? state.sessionStat
-                : [...state.sessionStat.slice(0, state.sessionStat.length - 1)];
+                : [...state.sessionStat];
             return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: false };
         case CLEAN_SESSION_STAT:

[Timeout] ArithmeticOperator
src/store/statisticReduser.ts:57:50
         case UPDATE_SESSION_STAT:
             const fixedSessions = state.lastSessionFixed
                 ? state.sessionStat
-                : [...state.sessionStat.slice(0, state.sessionStat.length - 1)];
+                : [...state.sessionStat.slice(0, state.sessionStat.length + 1)];
             return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: false };
         case CLEAN_SESSION_STAT:

[Timeout] BooleanLiteral
src/store/statisticReduser.ts:58:105
             const fixedSessions = state.lastSessionFixed
                 ? state.sessionStat
                 : [...state.sessionStat.slice(0, state.sessionStat.length - 1)];
-            return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: false };
+            return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: true };
         case CLEAN_SESSION_STAT:
             return { ...state, sessionStat: [], lastSessionFixed: false };

[Timeout] ConditionalExpression
src/store/statisticReduser.ts:59:9
                 ? state.sessionStat
                 : [...state.sessionStat.slice(0, state.sessionStat.length - 1)];
             return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: false };
-        case CLEAN_SESSION_STAT:
-            return { ...state, sessionStat: [], lastSessionFixed: false };
+        case CLEAN_SESSION_STAT:
         default:
             return state;

[Timeout] BooleanLiteral
src/store/statisticReduser.ts:60:67
                 : [...state.sessionStat.slice(0, state.sessionStat.length - 1)];
             return { ...state, sessionStat: [...fixedSessions, action.sessionResult], lastSessionFixed: false };
         case CLEAN_SESSION_STAT:
-            return { ...state, sessionStat: [], lastSessionFixed: false };
+            return { ...state, sessionStat: [], lastSessionFixed: true };
         default:
             return state;
