[Timeout] BlockStatement
src/store.ts:14:22
     statistic: statisticReduser,
 });
 
-function* rootSaga() {
-    yield all([loginSaga(), gameSaga()]);
-}
+function* rootSaga() {}
 
 export function setupStore(runSaga: boolean) {

[Survived] ConditionalExpression
src/store.ts:24:5
         reducer: rootReducer,
         middleware: (getDefaultMiddleware) => getDefaultMiddleware().concat(sagaMiddleware),
     });
-    runSaga && sagaMiddleware.run(rootSaga);
+    false;
     return store;
 }

[Timeout] ConditionalExpression
src/store.ts:24:5
         reducer: rootReducer,
         middleware: (getDefaultMiddleware) => getDefaultMiddleware().concat(sagaMiddleware),
     });
-    runSaga && sagaMiddleware.run(rootSaga);
+    true;
     return store;
 }
