[Timeout] BlockStatement
src/pages/index.tsx:7:21
 import TextDialog from "../components/TextDialog";
 import { login, loginSelector } from "../store/sessionReduser";
 
-const Login = () => {
-    const isLogin = useSelector(loginSelector);
-    const dispatch = useDispatch();
-    const router = useRouter();
-
-    useEffect(() => {
-        isLogin && router.push("/game");
-    }, [isLogin, router]);
-
-    const onOk = (value: string) => {
-        if (value.trim().length > 0) {
-            dispatch(login(value));
-        }
-    };
-
-    return (
-        <>
-            <TextDialog message="Кто ты, воин?" onOk={onOk} />
-        </>
-    );
-};
+const Login = () => {};
 
 export default Login;

[Timeout] BlockStatement
src/pages/index.tsx:12:21
     const dispatch = useDispatch();
     const router = useRouter();
 
-    useEffect(() => {
-        isLogin && router.push("/game");
-    }, [isLogin, router]);
+    useEffect(() => {}, [isLogin, router]);
 
     const onOk = (value: string) => {

[Timeout] ConditionalExpression
src/pages/index.tsx:13:9
     const router = useRouter();
 
     useEffect(() => {
-        isLogin && router.push("/game");
+        true;
     }, [isLogin, router]);
 

[Timeout] ConditionalExpression
src/pages/index.tsx:13:9
     const router = useRouter();
 
     useEffect(() => {
-        isLogin && router.push("/game");
+        false;
     }, [isLogin, router]);
 

[Timeout] BlockStatement
src/pages/index.tsx:16:37
         isLogin && router.push("/game");
     }, [isLogin, router]);
 
-    const onOk = (value: string) => {
-        if (value.trim().length > 0) {
-            dispatch(login(value));
-        }
-    };
+    const onOk = (value: string) => {};
 
     return (

[Timeout] MethodExpression
src/pages/index.tsx:17:13
     }, [isLogin, router]);
 
     const onOk = (value: string) => {
-        if (value.trim().length > 0) {
+        if (value.length > 0) {
             dispatch(login(value));
         }

[Timeout] ConditionalExpression
src/pages/index.tsx:17:13
     }, [isLogin, router]);
 
     const onOk = (value: string) => {
-        if (value.trim().length > 0) {
+        if (true) {
             dispatch(login(value));
         }
