[Timeout] BlockStatement
src/pages/_app.tsx:7:65
 import { useEffect, useState } from "react";
 import { Provider } from "react-redux";
 
-export default function App({ Component, pageProps }: AppProps) {
-    const [store, setStore] = useState<AppStore>(setupStore(false));
-
-    useEffect(() => {
-        setStore(setupStore(true));
-    }, []);
-
-    return (
-        <Provider store={store}>
-            <Component {...pageProps} />
-        </Provider>
-    );
-}
+export default function App({ Component, pageProps }: AppProps) {}
 

[Timeout] BooleanLiteral
src/pages/_app.tsx:8:61
 import { Provider } from "react-redux";
 
 export default function App({ Component, pageProps }: AppProps) {
-    const [store, setStore] = useState<AppStore>(setupStore(false));
+    const [store, setStore] = useState<AppStore>(setupStore(true));
 
     useEffect(() => {

[Timeout] BlockStatement
src/pages/_app.tsx:10:21
 export default function App({ Component, pageProps }: AppProps) {
     const [store, setStore] = useState<AppStore>(setupStore(false));
 
-    useEffect(() => {
-        setStore(setupStore(true));
-    }, []);
+    useEffect(() => {}, []);
 
     return (

[Timeout] BooleanLiteral
src/pages/_app.tsx:11:29
     const [store, setStore] = useState<AppStore>(setupStore(false));
 
     useEffect(() => {
-        setStore(setupStore(true));
+        setStore(setupStore(false));
     }, []);
 
