[Timeout] ArrowFunction
src/components/color-picker/BrightnessSlider.tsx:25:19
 const BrightnessGradient = styled.div<BrightnessGradientProps>`
     width: 20px;
     height: 100%;
-    background: ${({ color }) => `linear-gradient(white, ${color}, black)`};
+    background: ${() => undefined};
     user-select: none;
 `;

[Timeout] UnaryOperator
src/components/color-picker/BrightnessSlider.tsx:34:62
     onChangeColor: (color: string) => void;
 }
 
-const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
+const colorHex = (n: number) => ("0" + n.toString(16)).slice(+2);
 const brHexColor = (value: string, brightness: number) => {
     const n = Number("0x" + value);

[Timeout] MethodExpression
src/components/color-picker/BrightnessSlider.tsx:34:33
     onChangeColor: (color: string) => void;
 }
 
-const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
+const colorHex = (n: number) => "0" + n.toString(16);
 const brHexColor = (value: string, brightness: number) => {
     const n = Number("0x" + value);

[Timeout] BlockStatement
src/components/color-picker/BrightnessSlider.tsx:35:59
 }
 
 const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
-const brHexColor = (value: string, brightness: number) => {
-    const n = Number("0x" + value);
-    return colorHex(Math.floor(((brightness > 0 ? 255 - n : n) * brightness) / 100 + n));
-};
+const brHexColor = (value: string, brightness: number) => {};
 
 const BrightnessSlider = (props: BrightnessSliderProps) => {

[Timeout] StringLiteral
src/components/color-picker/BrightnessSlider.tsx:36:22
 
 const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
 const brHexColor = (value: string, brightness: number) => {
-    const n = Number("0x" + value);
+    const n = Number("" + value);
     return colorHex(Math.floor(((brightness > 0 ? 255 - n : n) * brightness) / 100 + n));
 };

[Timeout] ConditionalExpression
src/components/color-picker/BrightnessSlider.tsx:37:34
 const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
 const brHexColor = (value: string, brightness: number) => {
     const n = Number("0x" + value);
-    return colorHex(Math.floor(((brightness > 0 ? 255 - n : n) * brightness) / 100 + n));
+    return colorHex(Math.floor(((true ? 255 - n : n) * brightness) / 100 + n));
 };
 

[Timeout] EqualityOperator
src/components/color-picker/BrightnessSlider.tsx:37:34
 const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
 const brHexColor = (value: string, brightness: number) => {
     const n = Number("0x" + value);
-    return colorHex(Math.floor(((brightness > 0 ? 255 - n : n) * brightness) / 100 + n));
+    return colorHex(Math.floor(((brightness >= 0 ? 255 - n : n) * brightness) / 100 + n));
 };
 

[Timeout] BlockStatement
src/components/color-picker/BrightnessSlider.tsx:45:21
 
     const [value, setValue] = useState<number>(0);
 
-    useEffect(() => {
-        const brColor =
-            "#" +
-            brHexColor(color.substring(1, 3), value) +
-            brHexColor(color.substring(3, 5), value) +
-            brHexColor(color.substring(5, 7), value);
-        onChangeColor(brColor);
-    }, [value, color, onChangeColor]);
+    useEffect(() => {}, [value, color, onChangeColor]);
 
     return (

[Timeout] MethodExpression
src/components/color-picker/BrightnessSlider.tsx:48:24
     useEffect(() => {
         const brColor =
             "#" +
-            brHexColor(color.substring(1, 3), value) +
+            brHexColor(color, value) +
             brHexColor(color.substring(3, 5), value) +
             brHexColor(color.substring(5, 7), value);

[Timeout] MethodExpression
src/components/color-picker/BrightnessSlider.tsx:49:24
         const brColor =
             "#" +
             brHexColor(color.substring(1, 3), value) +
-            brHexColor(color.substring(3, 5), value) +
+            brHexColor(color, value) +
             brHexColor(color.substring(5, 7), value);
         onChangeColor(brColor);

[Timeout] MethodExpression
src/components/color-picker/BrightnessSlider.tsx:50:24
             "#" +
             brHexColor(color.substring(1, 3), value) +
             brHexColor(color.substring(3, 5), value) +
-            brHexColor(color.substring(5, 7), value);
+            brHexColor(color, value);
         onChangeColor(brColor);
     }, [value, color, onChangeColor]);

[Timeout] UnaryOperator
src/components/color-picker/BrightnessSlider.tsx:60:22
             <Slider
                 type={"range"}
                 value={value}
-                min={-100}
+                min={+100}
                 max={100}
                 onChange={(e: React.ChangeEvent<HTMLInputElement>) => {

[Timeout] BlockStatement
src/components/color-picker/BrightnessSlider.tsx:62:71
                 value={value}
                 min={-100}
                 max={100}
-                onChange={(e: React.ChangeEvent<HTMLInputElement>) => {
-                    setValue(parseInt(e.target.value));
-                }}
+                onChange={(e: React.ChangeEvent<HTMLInputElement>) => {}}
                 data-testid="color-slider"
             />
