[Timeout] ArithmeticOperator
src/common/Tools.ts:26:31
     const result = generateFieldByField(field.width, field.height, field);
     result.generation = 0;
     const { data, width, height } = result;
-    const count = Math.floor((width * height * percent) / 100);
+    const count = Math.floor((width / height * percent) / 100);
     const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
     for (let r = 0; r < count; r++) {

[Timeout] ArithmeticOperator
src/common/Tools.ts:26:31
     const result = generateFieldByField(field.width, field.height, field);
     result.generation = 0;
     const { data, width, height } = result;
-    const count = Math.floor((width * height * percent) / 100);
+    const count = Math.floor((width * height / percent) / 100);
     const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
     for (let r = 0; r < count; r++) {

[Timeout] ArithmeticOperator
src/common/Tools.ts:27:72
     result.generation = 0;
     const { data, width, height } = result;
     const count = Math.floor((width * height * percent) / 100);
-    const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
+    const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a - (b ? 1 : 0), 0), 0);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;

[Timeout] ArithmeticOperator
src/common/Tools.ts:27:45
     result.generation = 0;
     const { data, width, height } = result;
     const count = Math.floor((width * height * percent) / 100);
-    const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
+    const alive = data.reduce((sum, row) => sum - row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;

[Timeout] EqualityOperator
src/common/Tools.ts:28:21
     const { data, width, height } = result;
     const count = Math.floor((width * height * percent) / 100);
     const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
-    for (let r = 0; r < count; r++) {
+    for (let r = 0; r >= count; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;

[Timeout] ConditionalExpression
src/common/Tools.ts:28:21
     const { data, width, height } = result;
     const count = Math.floor((width * height * percent) / 100);
     const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
-    for (let r = 0; r < count; r++) {
+    for (let r = 0; false; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;

[Timeout] ArithmeticOperator
src/common/Tools.ts:30:50
     const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
-        const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;
+        const rand = Math.floor(Math.random() * (width * height + r - alive)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {

[Timeout] ArithmeticOperator
src/common/Tools.ts:30:33
     const alive = data.reduce((sum, row) => sum + row.reduce((a, b) => a + (b ? 1 : 0), 0), 0);
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
-        const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;
+        const rand = Math.floor(Math.random() / (width * height - r - alive)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {

[Timeout] BlockStatement
src/common/Tools.ts:31:42
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;
-        for (let i = 0; i < height; i++) {
-            for (let j = 0; j < width; j++) {
-                if (data[i][j] === undefined) {
-                    deadOffset++;
-                }
-                if (rand === deadOffset) {
-                    data[i][j] = color || getRandom();
-                    break;
-                }
-            }
-            if (rand === deadOffset) {
-                break;
-            }
-        }
+        for (let i = 0; i < height; i++) {}
     }
     return result;

[Timeout] EqualityOperator
src/common/Tools.ts:31:25
     for (let r = 0; r < count; r++) {
         let deadOffset = 0;
         const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;
-        for (let i = 0; i < height; i++) {
+        for (let i = 0; i >= height; i++) {
             for (let j = 0; j < width; j++) {
                 if (data[i][j] === undefined) {

[Timeout] EqualityOperator
src/common/Tools.ts:33:21
         const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {
-                if (data[i][j] === undefined) {
+                if (data[i][j] !== undefined) {
                     deadOffset++;
                 }

[Timeout] ConditionalExpression
src/common/Tools.ts:33:21
         const rand = Math.floor(Math.random() * (width * height - r - alive)) + 1;
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {
-                if (data[i][j] === undefined) {
+                if (false) {
                     deadOffset++;
                 }

[Timeout] UpdateOperator
src/common/Tools.ts:34:21
         for (let i = 0; i < height; i++) {
             for (let j = 0; j < width; j++) {
                 if (data[i][j] === undefined) {
-                    deadOffset++;
+                    deadOffset--;
                 }
                 if (rand === deadOffset) {

[Timeout] ConditionalExpression
src/common/Tools.ts:36:21
                 if (data[i][j] === undefined) {
                     deadOffset++;
                 }
-                if (rand === deadOffset) {
+                if (false) {
                     data[i][j] = color || getRandom();
                     break;

[Timeout] LogicalOperator
src/common/Tools.ts:37:34
                     deadOffset++;
                 }
                 if (rand === deadOffset) {
-                    data[i][j] = color || getRandom();
+                    data[i][j] = color && getRandom();
                     break;
                 }

[Timeout] EqualityOperator
src/common/Tools.ts:53:21
     const targetField = generateField(width, height);
     const minWidth = Math.min(targetField.width, sourceField.width);
     const minHeight = Math.min(targetField.height, sourceField.height);
-    for (let i = 0; i < minHeight; i++) {
+    for (let i = 0; i <= minHeight; i++) {
         for (let j = 0; j < minWidth; j++) {
             targetField.data[i][j] = sourceField.data[i][j];

[Timeout] ConditionalExpression
src/common/Tools.ts:54:25
     const minWidth = Math.min(targetField.width, sourceField.width);
     const minHeight = Math.min(targetField.height, sourceField.height);
     for (let i = 0; i < minHeight; i++) {
-        for (let j = 0; j < minWidth; j++) {
+        for (let j = 0; false; j++) {
             targetField.data[i][j] = sourceField.data[i][j];
         }

[Timeout] BlockStatement
src/common/Tools.ts:77:38
 export const getEnvironment = (field: Field): string[][][] => {
     const { width, height, data } = field;
     const result = initEmptyMatrix(width, height);
-    for (let i = 0; i < height; i++) {
-        for (let j = 0; j < width; j++) {
-            const cellValue = data[i][j];
-            if (cellValue !== undefined) {
-                for (let si = -1; si <= 1; si++) {
-                    for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
-                            const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
-                            result[row][cell].push(cellValue);
-                        }
-                    }
-                }
-            }
-        }
-    }
+    for (let i = 0; i < height; i++) {}
     return result;
 };

[Timeout] UpdateOperator
src/common/Tools.ts:77:33
 export const getEnvironment = (field: Field): string[][][] => {
     const { width, height, data } = field;
     const result = initEmptyMatrix(width, height);
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i < height; i--) {
         for (let j = 0; j < width; j++) {
             const cellValue = data[i][j];

[Timeout] BlockStatement
src/common/Tools.ts:80:42
     for (let i = 0; i < height; i++) {
         for (let j = 0; j < width; j++) {
             const cellValue = data[i][j];
-            if (cellValue !== undefined) {
-                for (let si = -1; si <= 1; si++) {
-                    for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
-                            const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
-                            result[row][cell].push(cellValue);
-                        }
-                    }
-                }
-            }
+            if (cellValue !== undefined) {}
         }
     }

[Timeout] UpdateOperator
src/common/Tools.ts:81:44
         for (let j = 0; j < width; j++) {
             const cellValue = data[i][j];
             if (cellValue !== undefined) {
-                for (let si = -1; si <= 1; si++) {
+                for (let si = -1; si <= 1; si--) {
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {

[Timeout] UnaryOperator
src/common/Tools.ts:81:31
         for (let j = 0; j < width; j++) {
             const cellValue = data[i][j];
             if (cellValue !== undefined) {
-                for (let si = -1; si <= 1; si++) {
+                for (let si = +1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {

[Timeout] UpdateOperator
src/common/Tools.ts:82:48
             const cellValue = data[i][j];
             if (cellValue !== undefined) {
                 for (let si = -1; si <= 1; si++) {
-                    for (let sj = -1; sj <= 1; sj++) {
+                    for (let sj = -1; sj <= 1; sj--) {
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;

[Timeout] BlockStatement
src/common/Tools.ts:83:51
             if (cellValue !== undefined) {
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
-                            const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
-                            result[row][cell].push(cellValue);
-                        }
+                        if (si !== 0 || sj !== 0) {}
                     }
                 }

[Timeout] ConditionalExpression
src/common/Tools.ts:83:41
             if (cellValue !== undefined) {
                 for (let si = -1; si <= 1; si++) {
                     for (let sj = -1; sj <= 1; sj++) {
-                        if (si !== 0 || sj !== 0) {
+                        if (si !== 0 || false) {
                             const row = (i + si + height) % height;
                             const cell = (j + sj + width) % width;

[Timeout] ArithmeticOperator
src/common/Tools.ts:85:42
                     for (let sj = -1; sj <= 1; sj++) {
                         if (si !== 0 || sj !== 0) {
                             const row = (i + si + height) % height;
-                            const cell = (j + sj + width) % width;
+                            const cell = (j + sj + width) * width;
                             result[row][cell].push(cellValue);
                         }

[Timeout] EqualityOperator
src/common/Tools.ts:98:21
 
 const getChild = (p: string[]): string => {
     let r = "#";
-    for (let i = 0; i < 3; i++) {
+    for (let i = 0; i >= 3; i++) {
         const k = Math.floor(Math.random() * p.length);
         r += p[k].substring(1 + i * 2, 3 + i * 2);

[Timeout] ConditionalExpression
src/common/Tools.ts:98:21
 
 const getChild = (p: string[]): string => {
     let r = "#";
-    for (let i = 0; i < 3; i++) {
+    for (let i = 0; false; i++) {
         const k = Math.floor(Math.random() * p.length);
         r += p[k].substring(1 + i * 2, 3 + i * 2);

[Timeout] ArithmeticOperator
src/common/Tools.ts:99:30
 const getChild = (p: string[]): string => {
     let r = "#";
     for (let i = 0; i < 3; i++) {
-        const k = Math.floor(Math.random() * p.length);
+        const k = Math.floor(Math.random() / p.length);
         r += p[k].substring(1 + i * 2, 3 + i * 2);
     }

[Timeout] ArithmeticOperator
src/common/Tools.ts:100:40
     let r = "#";
     for (let i = 0; i < 3; i++) {
         const k = Math.floor(Math.random() * p.length);
-        r += p[k].substring(1 + i * 2, 3 + i * 2);
+        r += p[k].substring(1 + i * 2, 3 - i * 2);
     }
     return r;

[Timeout] ArithmeticOperator
src/common/Tools.ts:100:44
     let r = "#";
     for (let i = 0; i < 3; i++) {
         const k = Math.floor(Math.random() * p.length);
-        r += p[k].substring(1 + i * 2, 3 + i * 2);
+        r += p[k].substring(1 + i * 2, 3 + i / 2);
     }
     return r;

[Timeout] StringLiteral
src/common/Tools.ts:106:22
 };
 
 const getRandom = () => {
-    return getChild(["#ff00ff", "#ffff00", "#00ffff"]);
+    return getChild(["", "#ffff00", "#00ffff"]);
 };
 

[Timeout] StringLiteral
src/common/Tools.ts:106:33
 };
 
 const getRandom = () => {
-    return getChild(["#ff00ff", "#ffff00", "#00ffff"]);
+    return getChild(["#ff00ff", "", "#00ffff"]);
 };
 

[Timeout] ConditionalExpression
src/common/Tools.ts:117:17
         for (let j = 0; j < width; j++) {
             const cellState = data[i][j];
             const cellEnv = environment[i][j];
-            if (!cellState && cellEnv.length === 3) {
+            if (true) {
                 result[i][j] = getChild(cellEnv);
             }

[Timeout] BlockStatement
src/common/Tools.ts:117:53
         for (let j = 0; j < width; j++) {
             const cellState = data[i][j];
             const cellEnv = environment[i][j];
-            if (!cellState && cellEnv.length === 3) {
-                result[i][j] = getChild(cellEnv);
-            }
+            if (!cellState && cellEnv.length === 3) {}
             if (cellState && cellEnv.length >= 2 && cellEnv.length <= 3) {
                 result[i][j] = cellState;

[Timeout] BlockStatement
src/common/Tools.ts:120:74
             if (!cellState && cellEnv.length === 3) {
                 result[i][j] = getChild(cellEnv);
             }
-            if (cellState && cellEnv.length >= 2 && cellEnv.length <= 3) {
-                result[i][j] = cellState;
-            }
+            if (cellState && cellEnv.length >= 2 && cellEnv.length <= 3) {}
         }
     }

[Timeout] ConditionalExpression
src/common/Tools.ts:120:53
             if (!cellState && cellEnv.length === 3) {
                 result[i][j] = getChild(cellEnv);
             }
-            if (cellState && cellEnv.length >= 2 && cellEnv.length <= 3) {
+            if (cellState && cellEnv.length >= 2 && true) {
                 result[i][j] = cellState;
             }

[Timeout] ConditionalExpression
src/common/Tools.ts:138:9
 };
 
 export const equalMatrix = (m1: (string | undefined)[][], m2: (string | undefined)[][]): boolean => {
-    if (m1.length !== m2.length) return false;
+    if (false) return false;
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];

[Timeout] BooleanLiteral
src/common/Tools.ts:138:41
 };
 
 export const equalMatrix = (m1: (string | undefined)[][], m2: (string | undefined)[][]): boolean => {
-    if (m1.length !== m2.length) return false;
+    if (m1.length !== m2.length) return true;
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];

[Timeout] ConditionalExpression
src/common/Tools.ts:142:13
     for (let i = 0; i < m1.length; i++) {
         const row1 = m1[i];
         const row2 = m2[i];
-        if (row1.length !== row2.length) return false;
+        if (true) return false;
         for (let j = 0; j < row1.length; j++) {
             if (row1[j] !== row2[j]) return false;

[Timeout] BlockStatement
src/common/Tools.ts:143:47
         const row1 = m1[i];
         const row2 = m2[i];
         if (row1.length !== row2.length) return false;
-        for (let j = 0; j < row1.length; j++) {
-            if (row1[j] !== row2[j]) return false;
-        }
+        for (let j = 0; j < row1.length; j++) {}
     }
     return true;

[Timeout] ConditionalExpression
src/common/Tools.ts:144:17
         const row2 = m2[i];
         if (row1.length !== row2.length) return false;
         for (let j = 0; j < row1.length; j++) {
-            if (row1[j] !== row2[j]) return false;
+            if (true) return false;
         }
     }

[Timeout] BlockStatement
src/common/Tools.ts:153:35
 export const createGameStat = (field: Field) => {
     let sum = 0;
     const colorStat: Record<string, number> = {};
-    for (const row of field.data) {
-        for (const cell of row) {
-            if (cell) {
-                sum++;
-                colorStat[cell] = (colorStat[cell] || 0) + 1;
-            }
-        }
-    }
+    for (const row of field.data) {}
     return { sum, colorStat, percent: (sum / (field.width * field.height)) * 100 };
 };

[Timeout] BlockStatement
src/common/Tools.ts:154:33
     let sum = 0;
     const colorStat: Record<string, number> = {};
     for (const row of field.data) {
-        for (const cell of row) {
-            if (cell) {
-                sum++;
-                colorStat[cell] = (colorStat[cell] || 0) + 1;
-            }
-        }
+        for (const cell of row) {}
     }
     return { sum, colorStat, percent: (sum / (field.width * field.height)) * 100 };

[Timeout] BlockStatement
src/common/Tools.ts:155:23
     const colorStat: Record<string, number> = {};
     for (const row of field.data) {
         for (const cell of row) {
-            if (cell) {
-                sum++;
-                colorStat[cell] = (colorStat[cell] || 0) + 1;
-            }
+            if (cell) {}
         }
     }

[Timeout] UpdateOperator
src/common/Tools.ts:156:17
     for (const row of field.data) {
         for (const cell of row) {
             if (cell) {
-                sum++;
+                sum--;
                 colorStat[cell] = (colorStat[cell] || 0) + 1;
             }

[Timeout] LogicalOperator
src/common/Tools.ts:157:36
         for (const cell of row) {
             if (cell) {
                 sum++;
-                colorStat[cell] = (colorStat[cell] || 0) + 1;
+                colorStat[cell] = (colorStat[cell] && 0) + 1;
             }
         }

[Timeout] ArithmeticOperator
src/common/Tools.ts:157:35
         for (const cell of row) {
             if (cell) {
                 sum++;
-                colorStat[cell] = (colorStat[cell] || 0) + 1;
+                colorStat[cell] = (colorStat[cell] || 0) - 1;
             }
         }

[Timeout] ArithmeticOperator
src/common/Tools.ts:161:47
             }
         }
     }
-    return { sum, colorStat, percent: (sum / (field.width * field.height)) * 100 };
+    return { sum, colorStat, percent: (sum / (field.width / field.height)) * 100 };
 };
 

[Timeout] ArithmeticOperator
src/common/Tools.ts:161:40
             }
         }
     }
-    return { sum, colorStat, percent: (sum / (field.width * field.height)) * 100 };
+    return { sum, colorStat, percent: (sum * (field.width * field.height)) * 100 };
 };
 
