[Timeout] StringLiteral
src/components/color-picker/ColorMap.tsx:4:32
 import React from "react";
 import styled from "styled-components";
 
-const MapContainer = styled.div`
-    position: relative;
-    flex-grow: 1;
-`;
+const MapContainer = styled.div``;
 
 const RGBgradient = styled.div`

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:25:42
 `;
 
 const getGreen = (hP: number, vP: number): number => {
-    const half = Math.floor(Math.min(1, (hP * 6) % 3) * 255);
+    const half = Math.floor(Math.min(1, (hP / 6) % 3) * 255);
     const result = hP % 1 < 0.5 ? half : 255 - half;
     return result - Math.floor((result - 127) * vP);

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:25:29
 `;
 
 const getGreen = (hP: number, vP: number): number => {
-    const half = Math.floor(Math.min(1, (hP * 6) % 3) * 255);
+    const half = Math.floor(Math.min(1, hP * 6 % 3) / 255);
     const result = hP % 1 < 0.5 ? half : 255 - half;
     return result - Math.floor((result - 127) * vP);

[Timeout] ConditionalExpression
src/components/color-picker/ColorMap.tsx:26:20
 
 const getGreen = (hP: number, vP: number): number => {
     const half = Math.floor(Math.min(1, (hP * 6) % 3) * 255);
-    const result = hP % 1 < 0.5 ? half : 255 - half;
+    const result = false ? half : 255 - half;
     return result - Math.floor((result - 127) * vP);
 };

[Timeout] EqualityOperator
src/components/color-picker/ColorMap.tsx:26:20
 
 const getGreen = (hP: number, vP: number): number => {
     const half = Math.floor(Math.min(1, (hP * 6) % 3) * 255);
-    const result = hP % 1 < 0.5 ? half : 255 - half;
+    const result = hP % 1 >= 0.5 ? half : 255 - half;
     return result - Math.floor((result - 127) * vP);
 };

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:27:33
 const getGreen = (hP: number, vP: number): number => {
     const half = Math.floor(Math.min(1, (hP * 6) % 3) * 255);
     const result = hP % 1 < 0.5 ? half : 255 - half;
-    return result - Math.floor((result - 127) * vP);
+    return result - Math.floor((result + 127) * vP);
 };
 

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:27:32
 const getGreen = (hP: number, vP: number): number => {
     const half = Math.floor(Math.min(1, (hP * 6) % 3) * 255);
     const result = hP % 1 < 0.5 ? half : 255 - half;
-    return result - Math.floor((result - 127) * vP);
+    return result - Math.floor((result - 127) / vP);
 };
 

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:33:16
 const colorHex = (n: number) => ("0" + n.toString(16)).slice(-2);
 
 export const getColorByMap = (x: number, y: number, width: number, height: number): string => {
-    const hP = x / width;
+    const hP = x * width;
     const vP = y / height;
     const r = getGreen(((3 * x + width) / (width * 3)) % 1, vP);

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:34:16
 
 export const getColorByMap = (x: number, y: number, width: number, height: number): string => {
     const hP = x / width;
-    const vP = y / height;
+    const vP = y * height;
     const r = getGreen(((3 * x + width) / (width * 3)) % 1, vP);
     const g = getGreen(hP, vP);

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:35:24
 export const getColorByMap = (x: number, y: number, width: number, height: number): string => {
     const hP = x / width;
     const vP = y / height;
-    const r = getGreen(((3 * x + width) / (width * 3)) % 1, vP);
+    const r = getGreen((3 * x + width) / (width * 3) * 1, vP);
     const g = getGreen(hP, vP);
     const b = getGreen(((3 * x + 2 * width) / (width * 3)) % 1, vP);

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:35:26
 export const getColorByMap = (x: number, y: number, width: number, height: number): string => {
     const hP = x / width;
     const vP = y / height;
-    const r = getGreen(((3 * x + width) / (width * 3)) % 1, vP);
+    const r = getGreen(((3 * x - width) / (width * 3)) % 1, vP);
     const g = getGreen(hP, vP);
     const b = getGreen(((3 * x + 2 * width) / (width * 3)) % 1, vP);

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:37:25
     const vP = y / height;
     const r = getGreen(((3 * x + width) / (width * 3)) % 1, vP);
     const g = getGreen(hP, vP);
-    const b = getGreen(((3 * x + 2 * width) / (width * 3)) % 1, vP);
+    const b = getGreen(((3 * x + 2 * width) * (width * 3)) % 1, vP);
     return "#" + colorHex(r) + colorHex(g) + colorHex(b);
 };

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:37:34
     const vP = y / height;
     const r = getGreen(((3 * x + width) / (width * 3)) % 1, vP);
     const g = getGreen(hP, vP);
-    const b = getGreen(((3 * x + 2 * width) / (width * 3)) % 1, vP);
+    const b = getGreen(((3 * x + 2 / width) / (width * 3)) % 1, vP);
     return "#" + colorHex(r) + colorHex(g) + colorHex(b);
 };

[Timeout] BlockStatement
src/components/color-picker/ColorMap.tsx:48:66
 const ColorMap = (props: ColorMapProps) => {
     const { onChangeColor: onColorChange, ...other } = props;
 
-    const onClick = (event: React.MouseEvent<HTMLDivElement>) => {
-        const div = event.target as HTMLDivElement;
-        const rects = div.getClientRects();
-        const { left, top } = rects.length > 0 ? rects[0] : { left: 0, top: 0 };
-        const x = event.pageX - left;
-        const y = event.pageY - top;
-        onColorChange(getColorByMap(x, y, div.offsetWidth, div.offsetHeight));
-    };
+    const onClick = (event: React.MouseEvent<HTMLDivElement>) => {};
 
     return (

[Timeout] EqualityOperator
src/components/color-picker/ColorMap.tsx:51:31
     const onClick = (event: React.MouseEvent<HTMLDivElement>) => {
         const div = event.target as HTMLDivElement;
         const rects = div.getClientRects();
-        const { left, top } = rects.length > 0 ? rects[0] : { left: 0, top: 0 };
+        const { left, top } = rects.length <= 0 ? rects[0] : { left: 0, top: 0 };
         const x = event.pageX - left;
         const y = event.pageY - top;

[Timeout] ConditionalExpression
src/components/color-picker/ColorMap.tsx:51:31
     const onClick = (event: React.MouseEvent<HTMLDivElement>) => {
         const div = event.target as HTMLDivElement;
         const rects = div.getClientRects();
-        const { left, top } = rects.length > 0 ? rects[0] : { left: 0, top: 0 };
+        const { left, top } = true ? rects[0] : { left: 0, top: 0 };
         const x = event.pageX - left;
         const y = event.pageY - top;

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:52:19
         const div = event.target as HTMLDivElement;
         const rects = div.getClientRects();
         const { left, top } = rects.length > 0 ? rects[0] : { left: 0, top: 0 };
-        const x = event.pageX - left;
+        const x = event.pageX + left;
         const y = event.pageY - top;
         onColorChange(getColorByMap(x, y, div.offsetWidth, div.offsetHeight));

[Timeout] ArithmeticOperator
src/components/color-picker/ColorMap.tsx:53:19
         const rects = div.getClientRects();
         const { left, top } = rects.length > 0 ? rects[0] : { left: 0, top: 0 };
         const x = event.pageX - left;
-        const y = event.pageY - top;
+        const y = event.pageY + top;
         onColorChange(getColorByMap(x, y, div.offsetWidth, div.offsetHeight));
     };
