[Timeout] MethodExpression
src/components/statistic/Histogram.tsx:14:20
     const width = 180;
     const height = 90;
 
-    const colors = Object.getOwnPropertyNames(data).sort();
+    const colors = Object.getOwnPropertyNames(data);
     const max = Math.max(...Object.values(data));
 

[Timeout] ArithmeticOperator
src/components/statistic/Histogram.tsx:17:24
     const colors = Object.getOwnPropertyNames(data).sort();
     const max = Math.max(...Object.values(data));
 
-    const towerWidth = width / colors.length;
+    const towerWidth = width * colors.length;
     const towers = colors.map((color, i) => {
         const coords = {

[Timeout] ArithmeticOperator
src/components/statistic/Histogram.tsx:20:17
     const towerWidth = width / colors.length;
     const towers = colors.map((color, i) => {
         const coords = {
-            x1: i * towerWidth,
+            x1: i / towerWidth,
             x2: (i + 1) * towerWidth,
             y1: height,

[Timeout] ArithmeticOperator
src/components/statistic/Histogram.tsx:21:17
     const towers = colors.map((color, i) => {
         const coords = {
             x1: i * towerWidth,
-            x2: (i + 1) * towerWidth,
+            x2: (i + 1) / towerWidth,
             y1: height,
             y2: height - (data[color] / max) * height,

[Timeout] ArithmeticOperator
src/components/statistic/Histogram.tsx:21:18
     const towers = colors.map((color, i) => {
         const coords = {
             x1: i * towerWidth,
-            x2: (i + 1) * towerWidth,
+            x2: (i - 1) * towerWidth,
             y1: height,
             y2: height - (data[color] / max) * height,

[Timeout] ArithmeticOperator
src/components/statistic/Histogram.tsx:23:27
             x1: i * towerWidth,
             x2: (i + 1) * towerWidth,
             y1: height,
-            y2: height - (data[color] / max) * height,
+            y2: height - (data[color] * max) * height,
         };
         return (

[Timeout] ArithmeticOperator
src/components/statistic/Histogram.tsx:23:17
             x1: i * towerWidth,
             x2: (i + 1) * towerWidth,
             y1: height,
-            y2: height - (data[color] / max) * height,
+            y2: height + data[color] / max * height,
         };
         return (
