[Timeout] StringLiteral
src/components/styled/Label.tsx:13:37
     large: "24px",
 };
 
-const Label = styled.div<LabelProps>`
-    color: #ddd;
-    font-size: ${({ size = "medium" }) => sizes[size]};
-    margin: auto;
-    user-select: none;
-    flex-grow: 1;
-    padding: 0px 5px;
-`;
+const Label = styled.div<LabelProps>``;
 
 export default Label;
