[Timeout] StringLiteral
src/components/GameField.stories.tsx:16:11
 export const AllDead = Template.bind({});
 
 const u = undefined;
-const r = "#ff0000";
+const r = "";
 const g = "#00ff00";
 const b = "#0000ff";

[Timeout] StringLiteral
src/components/GameField.stories.tsx:17:11
 
 const u = undefined;
 const r = "#ff0000";
-const g = "#00ff00";
+const g = "";
 const b = "#0000ff";
 

[Timeout] ObjectLiteral
src/components/GameField.stories.tsx:20:16
 const g = "#00ff00";
 const b = "#0000ff";
 
-AllDead.args = {
-    field: [
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-    ],
-};
+AllDead.args = {};
 
 export const Chess = Template.bind({});

[Timeout] ArrayDeclaration
src/components/GameField.stories.tsx:21:12
 const b = "#0000ff";
 
 AllDead.args = {
-    field: [
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-        [u, u, u, u, u],
-    ],
+    field: [],
 };
 

[Timeout] ArrayDeclaration
src/components/GameField.stories.tsx:25:9
         [u, u, u, u, u],
         [u, u, u, u, u],
         [u, u, u, u, u],
-        [u, u, u, u, u],
+        [],
         [u, u, u, u, u],
     ],

[Timeout] ArrayDeclaration
src/components/GameField.stories.tsx:33:9
 export const Chess = Template.bind({});
 Chess.args = {
     field: [
-        [u, r, g, b, u],
+        [],
         [r, g, b, u, r],
         [g, b, u, r, g],
