[Timeout] BooleanLiteral
src/components/statistic/Histogram.stories.tsx:16:28
 export const RGB = Template.bind({});
 RGB.args = {
     data: { "#ff0000": 100, "#00ff00": 50, "#0000bb": 80 },
-    disableStartAnimation: true,
+    disableStartAnimation: false,
 };
 
