[Timeout] BooleanLiteral
src/components/statistic/HistogramTower.tsx:17:52
 }
 
 const HistogramTower = (props: HistogramTowerProps) => {
-    const { coords, color, disableStartAnimation = false } = props;
+    const { coords, color, disableStartAnimation = true } = props;
     const { x1, x2, y1, y2 } = coords;
     const sy = disableStartAnimation ? y2 : y1;

[Timeout] ObjectLiteral
src/components/statistic/HistogramTower.tsx:22:9
     const sy = disableStartAnimation ? y2 : y1;
 
     const [springs] = useSpring(
-        {
-            from: { d: `M${x1} ${y1} L${x1} ${sy} L${x2} ${sy} L${x2} ${y1}` },
-            to: { d: `M${x1} ${y1} L${x1} ${y2} L${x2} ${y2} L${x2} ${y1}` },
-        },
+        {},
         [x1, x2, y1, y2, sy]
     );

[Timeout] StringLiteral
src/components/statistic/HistogramTower.tsx:23:24
 
     const [springs] = useSpring(
         {
-            from: { d: `M${x1} ${y1} L${x1} ${sy} L${x2} ${sy} L${x2} ${y1}` },
+            from: { d: `` },
             to: { d: `M${x1} ${y1} L${x1} ${y2} L${x2} ${y2} L${x2} ${y1}` },
         },

[Timeout] ArrayDeclaration
src/components/statistic/HistogramTower.tsx:26:9
             from: { d: `M${x1} ${y1} L${x1} ${sy} L${x2} ${sy} L${x2} ${y1}` },
             to: { d: `M${x1} ${y1} L${x1} ${y2} L${x2} ${y2} L${x2} ${y1}` },
         },
-        [x1, x2, y1, y2, sy]
+        []
     );
 
