[Timeout] StringLiteral
src/components/GameField.tsx:12:49
     onCellClick?: (x: number, y: number) => void;
 }
 
-const GameFieldContainer = styled(MainContainer)`
-    grid-area: center;
-    width: fit-content;
-    margin: 0 auto;
-    padding: 10px 20px;
-    border-radius: 15px;
-    z-index: 1;
-`;
+const GameFieldContainer = styled(MainContainer)``;
 
 const GameField = (props: GameFieldProps) => {

[Timeout] ArrowFunction
src/components/GameField.tsx:26:24
 
     return (
         <GameFieldContainer>
-            {field.map((row, i) => (
-                <GameFieldRow key={i}>
-                    {row.map((cell, j) => (
-                        <Cell
-                            key={j}
-                            color={cell}
-                            onClick={() => {
-                                onCellClick(i, j);
-                            }}
-                        />
-                    ))}
-                </GameFieldRow>
-            ))}
+            {field.map(() => undefined)}
         </GameFieldContainer>
     );

[Timeout] ArrowFunction
src/components/GameField.tsx:28:30
         <GameFieldContainer>
             {field.map((row, i) => (
                 <GameFieldRow key={i}>
-                    {row.map((cell, j) => (
-                        <Cell
-                            key={j}
-                            color={cell}
-                            onClick={() => {
-                                onCellClick(i, j);
-                            }}
-                        />
-                    ))}
+                    {row.map(() => undefined)}
                 </GameFieldRow>
             ))}

[Timeout] BlockStatement
src/components/GameField.tsx:32:44
                         <Cell
                             key={j}
                             color={cell}
-                            onClick={() => {
-                                onCellClick(i, j);
-                            }}
+                            onClick={() => {}}
                         />
                     ))}
