[Timeout] Regex
src/components/TopMenu.tsx:41:58
         setRandom(event.target.value);
     };
 
-    const matchResult: string | undefined = random.match(/^\d+%?$/)?.[0];
+    const matchResult: string | undefined = random.match(/^\d+%$/)?.[0];
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
     const validRandom = randomValue <= 100;

[Timeout] BlockStatement
src/components/TopMenu.tsx:45:60
     const randomValue: number = matchResult === undefined ? 101 : parseInt(matchResult);
     const validRandom = randomValue <= 100;
 
-    const onRandomButtonClick = (rColor?: string) => () => {
-        if (validRandom) {
-            if (mode === "pause") {
-                dispatch(newGame(fillFieldRandom(field, randomValue, rColor)));
-            }
-        }
-    };
+    const onRandomButtonClick = (rColor?: string) => () => {};
 
     return (

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:46:13
     const validRandom = randomValue <= 100;
 
     const onRandomButtonClick = (rColor?: string) => () => {
-        if (validRandom) {
+        if (false) {
             if (mode === "pause") {
                 dispatch(newGame(fillFieldRandom(field, randomValue, rColor)));

[Timeout] BlockStatement
src/components/TopMenu.tsx:46:26
     const validRandom = randomValue <= 100;
 
     const onRandomButtonClick = (rColor?: string) => () => {
-        if (validRandom) {
-            if (mode === "pause") {
-                dispatch(newGame(fillFieldRandom(field, randomValue, rColor)));
-            }
-        }
+        if (validRandom) {}
     };
 

[Timeout] BlockStatement
src/components/TopMenu.tsx:47:35
 
     const onRandomButtonClick = (rColor?: string) => () => {
         if (validRandom) {
-            if (mode === "pause") {
-                dispatch(newGame(fillFieldRandom(field, randomValue, rColor)));
-            }
+            if (mode === "pause") {}
         }
     };

[Timeout] EqualityOperator
src/components/TopMenu.tsx:55:70
 
     return (
         <TopMenuContainer>
-            <Button onClick={() => dispatch(setMode("run"))} active={mode === "run"}>
+            <Button onClick={() => dispatch(setMode("run"))} active={mode !== "run"}>
                 Run
             </Button>

[Timeout] ConditionalExpression
src/components/TopMenu.tsx:58:72
             <Button onClick={() => dispatch(setMode("run"))} active={mode === "run"}>
                 Run
             </Button>
-            <Button onClick={() => dispatch(setMode("pause"))} active={mode === "pause"}>
+            <Button onClick={() => dispatch(setMode("pause"))} active={true}>
                 Pause
             </Button>

[Timeout] ArrowFunction
src/components/TopMenu.tsx:75:59
             </ProfileContainer>
             <ProfileContainer>
                 <Label>{playerName}</Label>
-                <SvgButton icon={logoutIcon.src} onClick={() => dispatch(logout())} />
+                <SvgButton icon={logoutIcon.src} onClick={() => undefined} />
             </ProfileContainer>
         </TopMenuContainer>
