[Timeout] StringLiteral
src/components/color-picker/FixedColorPicker.tsx:10:49
     color: string;
 }
 
-const ColorPicker = styled.div<ColorPickerProps>`
-    width: 10px;
-    height: 10px;
-    background-color: ${({ color }) => color};
-`;
+const ColorPicker = styled.div<ColorPickerProps>``;
 
 const FixedColorPicker = (props: React.ComponentProps<typeof ColorPicker>) => {

[Timeout] ArrowFunction
src/components/color-picker/FixedColorPicker.tsx:13:25
 const ColorPicker = styled.div<ColorPickerProps>`
     width: 10px;
     height: 10px;
-    background-color: ${({ color }) => color};
+    background-color: ${() => undefined};
 `;
 

[Timeout] BlockStatement
src/components/color-picker/FixedColorPicker.tsx:22:28
     return (
         <ColorPicker
             {...props}
-            onClick={() => {
-                dispatch(setColor(props.color));
-            }}
+            onClick={() => {}}
         />
     );
