[Timeout] StringLiteral
src/components/color-picker/ColorPicker.tsx:10:32
 import ColorMap from "./ColorMap";
 import FixedColorPicker from "./FixedColorPicker";
 
-const MapContainer = styled.div`
-    display: flex;
-    flex-direction: row;
-    gap: 10px;
-    min-width: 150px;
-`;
+const MapContainer = styled.div``;
 
 const ColorIndicator = styled.div`

[Timeout] StringLiteral
src/components/color-picker/ColorPicker.tsx:17:34
     min-width: 150px;
 `;
 
-const ColorIndicator = styled.div`
-    width: 100%;
-    height: 15px;
-    margin-top: 5px;
-    user-select: none;
-`;
+const ColorIndicator = styled.div``;
 
 const FixPickerContainer = styled.div`

[Timeout] StringLiteral
src/components/color-picker/ColorPicker.tsx:24:38
     user-select: none;
 `;
 
-const FixPickerContainer = styled.div`
-    display: flex;
-    flex-direction: row;
-    gap: 5px;
-    margin-top: 5px;
-    user-select: none;
-`;
+const FixPickerContainer = styled.div``;
 
 const ColorPicker = (props: React.HTMLAttributes<HTMLDivElement>) => {

[Timeout] BlockStatement
src/components/color-picker/ColorPicker.tsx:37:28
     const [mapColor, setMapColor] = useState<string>("#ff0000");
     const dispatch = useDispatch();
     const onChangeColor = useCallback(
-        (color: string) => {
-            dispatch(setColor(color));
-        },
+        (color: string) => {},
         [dispatch]
     );
