[Timeout] ArrowFunction
src/components/styled/SvgButton.tsx:9:29
 }
 
 const SvgButton = styled(Button)<SvgButtonProps>`
-    background-image: url(${({ icon }) => icon});
+    background-image: url(${() => undefined});
     background-size: 80% 80%;
     background-color: unset;
