[Timeout] StringLiteral
src/components/statistic/GameChart.tsx:11:49
 
 type GameChartProps = Omit<SimpleChartProps, "data" | "width" | "height">;
 
-const GameChartContainer = styled(MainContainer)`
-    border-radius: 0 15px 15px 0;
-    margin: auto auto auto 0px;
-    padding: 10px;
-    display: flex;
-    flex-direction: column;
-`;
+const GameChartContainer = styled(MainContainer)``;
 
 const GameChart = (props: GameChartProps) => {
