[Timeout] ConditionalExpression
src/pages/game.tsx:59:9
     const router = useRouter();
 
     useEffect(() => {
-        !isLogin && router.push("/");
+        true;
     }, [isLogin, router]);
 

[Timeout] BlockStatement
src/pages/game.tsx:62:51
         !isLogin && router.push("/");
     }, [isLogin, router]);
 
-    const onCellClick = (x: number, y: number) => {
-        if (mode === "pause") {
-            const fieldData = field.data.map((row, i) => row.map((cell, j) => (i === x && j === y ? color : cell)));
-            dispatch(newGame({ ...field, data: fieldData, generation: 0 }));
-        }
-    };
+    const onCellClick = (x: number, y: number) => {};
 
     useEffect(() => {

[Timeout] BlockStatement
src/pages/game.tsx:63:31
     }, [isLogin, router]);
 
     const onCellClick = (x: number, y: number) => {
-        if (mode === "pause") {
-            const fieldData = field.data.map((row, i) => row.map((cell, j) => (i === x && j === y ? color : cell)));
-            dispatch(newGame({ ...field, data: fieldData, generation: 0 }));
-        }
+        if (mode === "pause") {}
     };
 

[Timeout] EqualityOperator
src/pages/game.tsx:64:80
 
     const onCellClick = (x: number, y: number) => {
         if (mode === "pause") {
-            const fieldData = field.data.map((row, i) => row.map((cell, j) => (i === x && j === y ? color : cell)));
+            const fieldData = field.data.map((row, i) => row.map((cell, j) => (i !== x && j === y ? color : cell)));
             dispatch(newGame({ ...field, data: fieldData, generation: 0 }));
         }

[Timeout] ConditionalExpression
src/pages/game.tsx:64:91
 
     const onCellClick = (x: number, y: number) => {
         if (mode === "pause") {
-            const fieldData = field.data.map((row, i) => row.map((cell, j) => (i === x && j === y ? color : cell)));
+            const fieldData = field.data.map((row, i) => row.map((cell, j) => (i === x && true ? color : cell)));
             dispatch(newGame({ ...field, data: fieldData, generation: 0 }));
         }

[Timeout] BlockStatement
src/pages/game.tsx:69:21
         }
     };
 
-    useEffect(() => {
-        if (mode === "run") {
-            const interval = setInterval(() => {
-                const nextField = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextField.data)) {
-                    dispatch(setMode("pause"));
-                } else {
-                    dispatch(nextGen(nextField));
-                }
-            }, speed);
-            return () => clearTimeout(interval);
-        }
-    }, [mode, speed, field, dispatch]);
+    useEffect(() => {}, [mode, speed, field, dispatch]);
 
     return (

[Timeout] EqualityOperator
src/pages/game.tsx:70:13
     };
 
     useEffect(() => {
-        if (mode === "run") {
+        if (mode !== "run") {
             const interval = setInterval(() => {
                 const nextField = generateNextGeneration(field);

[Timeout] BlockStatement
src/pages/game.tsx:70:29
     };
 
     useEffect(() => {
-        if (mode === "run") {
-            const interval = setInterval(() => {
-                const nextField = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextField.data)) {
-                    dispatch(setMode("pause"));
-                } else {
-                    dispatch(nextGen(nextField));
-                }
-            }, speed);
-            return () => clearTimeout(interval);
-        }
+        if (mode === "run") {}
     }, [mode, speed, field, dispatch]);
 

[Timeout] BlockStatement
src/pages/game.tsx:71:48
 
     useEffect(() => {
         if (mode === "run") {
-            const interval = setInterval(() => {
-                const nextField = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextField.data)) {
-                    dispatch(setMode("pause"));
-                } else {
-                    dispatch(nextGen(nextField));
-                }
-            }, speed);
+            const interval = setInterval(() => {}, speed);
             return () => clearTimeout(interval);
         }

[Timeout] ConditionalExpression
src/pages/game.tsx:73:21
         if (mode === "run") {
             const interval = setInterval(() => {
                 const nextField = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextField.data)) {
+                if (true) {
                     dispatch(setMode("pause"));
                 } else {

[Timeout] ConditionalExpression
src/pages/game.tsx:73:21
         if (mode === "run") {
             const interval = setInterval(() => {
                 const nextField = generateNextGeneration(field);
-                if (equalMatrix(field.data, nextField.data)) {
+                if (false) {
                     dispatch(setMode("pause"));
                 } else {

[Timeout] BlockStatement
src/pages/game.tsx:75:24
                 const nextField = generateNextGeneration(field);
                 if (equalMatrix(field.data, nextField.data)) {
                     dispatch(setMode("pause"));
-                } else {
-                    dispatch(nextGen(nextField));
-                }
+                } else {}
             }, speed);
             return () => clearTimeout(interval);
