[Timeout] StringLiteral
src/store/configReduser.ts:4:19
 import { RootState } from "../store";
 import { createSelector } from "@reduxjs/toolkit";
 
-const SET_COLOR = "src/store/sessionReduser/SET_COLOR";
+const SET_COLOR = "";
 
 interface SetColorAction {

[Timeout] ConditionalExpression
src/store/configReduser.ts:23:9
 
 export default function reducer(state: ConfigState = initState, action: Action): ConfigState {
     switch (action.type) {
-        case SET_COLOR:
-            return { ...state, color: action.color };
+        case SET_COLOR:
         default:
             return state;

[Timeout] ArrowFunction
src/store/configReduser.ts:36:5
 
 export const colorSelectior = createSelector(
     (state: RootState) => state.config,
-    (session: ConfigState) => session.color
+    () => undefined
 );
 
