[Timeout] StringLiteral
src/store/gameReduser.ts:17:14
 /* eslint-disable @typescript-eslint/no-explicit-any */
 const NEXT_GEN = "src/store/gameReduser/NEXT_GEN";
 const NEW_GAME = "src/store/gameReduser/NEW_GAME";
-const SIZE = "src/store/gameReduser/SIZE";
+const SIZE = "";
 const SPEED = "src/store/gameReduser/SPEED";
 const MODE = "src/store/gameReduser/MODE";

[Timeout] ConditionalExpression
src/store/gameReduser.ts:78:9
             return { ...state, speed: action.speed };
         case MODE:
             return { ...state, mode: action.mode };
-        case CLEAN:
-            return { ...state, field: generateField(state.field.width, state.field.height) };
+        case CLEAN:
         default:
             return state;

[Timeout] BlockStatement
src/store/gameReduser.ts:121:78
     (game: GameState) => game.mode
 );
 
-function* onNextGen(action: NextGenAction): Generator<PutEffect, void, void> {
-    const stat = createGameStat(action.field);
-    yield put(addGameStat(stat.sum));
-    yield put(updataColorStat(stat.colorStat));
-    yield put(updateSessionStat(stat.percent));
-}
+function* onNextGen(action: NextGenAction): Generator<PutEffect, void, void> {}
 
 export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {

[Timeout] BlockStatement
src/store/gameReduser.ts:128:85
     yield put(updateSessionStat(stat.percent));
 }
 
-export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {
-    yield takeEvery(NEXT_GEN, onNextGen);
-    yield takeEvery([NEW_GAME, CLEAN], function* () {
-        yield put(cleanGameStatistic());
-        yield put(fixSessionStat());
-    });
-}
+export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {}
 

[Timeout] BlockStatement
src/store/gameReduser.ts:130:53
 
 export function* gameSaga(): Generator<PutEffect | ForkEffect, void, string | null> {
     yield takeEvery(NEXT_GEN, onNextGen);
-    yield takeEvery([NEW_GAME, CLEAN], function* () {
-        yield put(cleanGameStatistic());
-        yield put(fixSessionStat());
-    });
+    yield takeEvery([NEW_GAME, CLEAN], function* () {});
 }
 
