[Timeout] ConditionalExpression
src/store/statisticReduser.ts:64:9
     switch (action.type) {
         case ADD_GAME_STAT:
             return { ...state, gameStat: [...state.gameStat, action.gameResult] };
-        case UPDATE_COLOR_STAT:
-            return { ...state, colorStat: action.colorStat };
+        case UPDATE_COLOR_STAT:
         case CLEAN_GAME_STAT:
             return { ...state, gameStat: [], colorStat: {} };

[Timeout] ConditionalExpression
src/store/statisticReduser.ts:66:9
             return { ...state, gameStat: [...state.gameStat, action.gameResult] };
         case UPDATE_COLOR_STAT:
             return { ...state, colorStat: action.colorStat };
-        case CLEAN_GAME_STAT:
-            return { ...state, gameStat: [], colorStat: {} };
+        case CLEAN_GAME_STAT:
         case FIX_SESSION_STAT:
             return { ...state, lastSessionFixed: true };
