[Survived] LogicalOperator
src/store.ts:26:5
         reducer: rootReducer,
         middleware: (getDefaultMiddleware) => getDefaultMiddleware().concat(sagaMiddleware),
     });
-    runSaga && sagaMiddleware.run(rootSaga);
+    runSaga || sagaMiddleware.run(rootSaga);
     return store;
 }
