[Timeout] ArrowFunction
src/components/styled/Cell.tsx:8:25
 }
 
 const Cell = styled.div<CellProps>`
-    background-color: ${(props) => props.color};
+    background-color: ${() => undefined};
     border: solid 1px #000;
     width: 10px;
